Vorlesung/ParProg-Grundlagen.org
#+SETUPFILE: ./theme-bigblow-local.setup
#+TITLE: Parallelprogrammierung -- Grundlagen
#+AUTHOR: Johannes Brauer
#+OPTIONS:   H:4
#+OPTIONS: num:nil d:true
#+OPTIONS: toc:nil
#+OPTIONS: reveal_single_file:nil
#+Language:  de
#+STARTUP: latexpreview
#+STARTUP: inlineimages
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
# +REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_THEME: simple
#+REVEAL_TRANS: slide
#+REVEAL_HLEVEL: 1
#+REVEAL_INIT_SCRIPT: dependencies: [ { src: 'plugin/menu/menu.js', async: true },
#+REVEAL_INIT_SCRIPT:                 { src: 'reveal.js/plugin/zoom-js/zoom.js', async: true } ]
#+REVEAL_MARGIN: 0.05
#+REVEAL_EXTRA_CSS: ./mycss/myrevealstyle.css
#+OPTIONS: reveal_control:t
# um Folien mit reveal.js erzeugen zu können:ml
# M-x load-library und dann ox-reveal

* Ein wenig Geschichte ...
** ... der Rechensysteme
  (vgl. cite:Bengel2015)
+ 1970 -- Stapelverarbeitung ::
  + Einlesen von Aufträgen (jobs) und Bearbeitung durch die Maschine
  + Job-Scheduler bestimmt die Abarbeitungsreihenfolge
  + /non-blocking IO/ kommt zum Einsatz (Nebenläufigkeit)
+ 1975 -- Timesharing-Systeme ::
  + interaktives Arbeiten mittels Kommandozeilen-Befehlen
  + Mehrbenutzerbetrieb
  + Zuteilung von Zeitscheiben
+ 1980 -- Personal Computer und Workstation ::
  + hohe Rechenleistung am Arbeitsplatz
  + Rückkehr zum Einbenutzerbetrieb
  + Kommandozeile + graphische Benutzungsoberflächen
  + Insellösungen -- kein Zugriff auf gemeinsame Betriebsmittel
  + Notlösung: peer-to-peer-Netze
+ 1985 -- Client-Server-Systeme ::
  + Zentralisierung bestimmter Dienste auf dedizierten Rechnern (server)
  + neue Betriebssystemkonzepte für Netzwerknutzung erforderlich
+ 1990 -- Cluster-Systeme ::
  + auch /Verteilte Systeme/
  + mehrere Rechner bzw. Multiprozessorsysteme teilen sich die Dienstserbringung
  + zur Erhöhung von Leistung und Ausfallsicherheit
  + Load Balancing Cluster / Serverfarmen
  + High Performance Computing (HPC) Cluster
    + Geschwindigkeitssteigerung durch Parallelisierung von Aufgaben
    + bei Ausfall eines Systems übernimmt ein anderes Cluster-Mitglied
      dessen Aufgaben
+ 1995 -- Peer-to-Peer-Systeme ::
  + jede Maschine kann Client und Server sein
  + höhere Ausfallsicherheit
+ 2005 -- Cloud-Systeme oder Cloud-Computing ::
  + Rezentralisierung der Rechenleistung durch Virtualisierung
  + Zugriff auf Ressourcen über Internet oder Intranet
** ... der Technologie
... der Prozessoren und Speicherchips
+ Mooresches Gesetz von 1965: Verdoppelung der Anzahl der Transistoren
  auf einem Chip ca. alle 18 Monate -- gilt noch heute
+ Entwicklung der Mikroprozessoren am Beispiel von Intel
  + 1971: Intel 4004, Transistoren: 2300, Taktrate: 108 kHz
  + 1999: Pentium III, Transistoren: 9.500.000, Taktrate: bis 1 GHz
  + 2000 bis 2008: Pentium 4, Transistoren: 42.000.000, Taktrate: bis
    3,8 GHz
+ Speicherkapazität pro Chip
  + 1970: 1 Kilobit
  + heute: 1 Gigabit
+ Preisverfall bei MIPS und Kosten pro Bit

* Rechnerarchitekturen für parallele und verteilte Systeme
(vgl.  cite:Bengel2015, cite:Kalin2015)
** Taxonomie von parallelen Rechnerarchitekturen nach Flynn 
# chapter 10 flynnTax.txt
(vgl. cite:Flynn1972)
+ Anmerkungen:
  + Die Taxonomie sagt nichts darüber aus, ob die Architektur ein
    einzelnes oder ein verteiltes System beschreibt.
  + TDie Taxonomie ist schon recht alt, wird aber als Referenz nach
    wie vor benutzt.
+ Abkürzungen:\\
  D = Daten\\
  I = Befehle (Instruktionen)\\
  P = Prozessor\\
  S steht für /single/, M für /multiple/.
  + Parallelität im Sinne dieser Taxonomie erfordert immer mehrere
    Prozessoren (P).
#+Reveal: split
+ SISD: single instruction, single data ::
  + keine Form von Parallelität
#+BEGIN_EXAMPLE
   +----------+    +---+    +----------+
   | D source |--->| P |<---| I source |                 
   +----------+    +---+    +----------+
#+END_EXAMPLE
+ SIMD: single instruction, multiple data ::
  + Unterstützung in verschiedenen Programmiersprachen
  + heutzutage besonders relevant
#+BEGIN_EXAMPLE
   +----------+    +---+
   | D source |--->| P |<---+
   +----------+    +---+    |
   +----------+    +---+    |  +----------+
   | D source |--->| P |<---+--| I source |               
   +----------+    +---+    |  +----------+
   +----------+    +---+    |
   | D source |--->| P |<---+
   +----------+    +---+
#+END_EXAMPLE   
#+Reveal: split
+ MISD: multiple instruction, single data ::
  + kaum praktische Bedeutung
#+BEGIN_EXAMPLE
                      +---+    +----------+
                 +--->| P |<---| I source |
                 |    +---+    +----------+
   +----------+  |    +---+    +----------+
   | D source |--+--->| P |<---| I source |               
   +----------+  |    +---+    +----------+ 
                 |    +---+    +----------+
                 +--->| P |<---| I source | 
                      +---+    +----------+
#+END_EXAMPLE
+ MIMD: multiple instruction, multiple data ::
  + am ehesten in verteilten Systemen anzutreffen
#+BEGIN_EXAMPLE
   +----------+    +---+    +----------+
   | D source |--->| P |<---| I source |
   +----------+    +---+    +----------+
   +----------+    +---+    +----------+
   | D source |--->| P |<---| I source |                  
   +----------+    +---+    +----------+
   +----------+    +---+    +----------+
   | D source |--->| P |<---| I source |
   +----------+    +---+    +----------+
#+END_EXAMPLE

** Ausprägungen
*** Eng gekoppelte Multiprozessoren und Multicore-Prozessoren
+ mehrere Prozesse können /echt/ parallel ablaufen (auf
  Einprozessorsystemen hingegen nur Quasi-Parallelität)
+ gemeinsamer Hauptspeicher
*** Vektorrechner 
+ Ausführung einer Berechnung gleichzeitig auf vielen Daten
+ Anordnung der Daten als Vektor bzw. Matrix
+ Beispiel für SIMD-Architektur
+ High-Performance-Computing
+ bekannt geworden ursprünglich durch Cray-Supercomputer (seit 1978)
+ genutzt z. B. für Simulationen (Meteorologie)
*** General Purpose Computation on Graphic Processing Unit (GPGPU) 
+ ursprünglich bestehend aus beschränkt programmierbaren
  Spezialprozessoren für Fließkommaoperationen
+ inzwischen frei programmierbare Prozessoren (tausende von Kernen),
  dadurch
+ nutzbar nicht nur für Grafikanwendungen
+ Verwendbarkeit in höheren Programmiersprachen durch spezielle
  Bibliotheken wie z. B. CUDA von Nvidia
+ Beispiel für SIMD-Architektur
