Vorlesung/ParProg-Grundlagen.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2017-10-10 Tue 12:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Parallelprogrammierung &#x2013; Grundlagen</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johannes Brauer" />
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
</head>
<body>
<div id="content">
<h1 class="title">Parallelprogrammierung &#x2013; Grundlagen</h1>

<div id="outline-container-org80bda55" class="outline-2">
<h2 id="org80bda55">Ein wenig Geschichte &#x2026;</h2>
<div class="outline-text-2" id="text-org80bda55">
</div><div id="outline-container-org5982bbb" class="outline-3">
<h3 id="org5982bbb">&#x2026; der Rechensysteme</h3>
<div class="outline-text-3" id="text-org5982bbb">
<p>
(vgl. <a class='org-ref-reference' href="#Bengel2015">Bengel2015</a>)
</p>
<dl class="org-dl">
<dt>1970 &#x2013; Stapelverarbeitung</dt><dd><ul class="org-ul">
<li>Einlesen von Aufträgen (jobs) und Bearbeitung durch die Maschine</li>
<li>Job-Scheduler bestimmt die Abarbeitungsreihenfolge</li>
<li><i>non-blocking IO</i> kommt zum Einsatz (Nebenläufigkeit)</li>
</ul></dd>
<dt>1975 &#x2013; Timesharing-Systeme</dt><dd><ul class="org-ul">
<li>interaktives Arbeiten mittels Kommandozeilen-Befehlen</li>
<li>Mehrbenutzerbetrieb</li>
<li>Zuteilung von Zeitscheiben</li>
</ul></dd>
<dt>1980 &#x2013; Personal Computer und Workstation</dt><dd><ul class="org-ul">
<li>hohe Rechenleistung am Arbeitsplatz</li>
<li>Rückkehr zum Einbenutzerbetrieb</li>
<li>Kommandozeile + graphische Benutzungsoberflächen</li>
<li>Insellösungen &#x2013; kein Zugriff auf gemeinsame Betriebsmittel</li>
<li>Notlösung: peer-to-peer-Netze</li>
</ul></dd>
<dt>1985 &#x2013; Client-Server-Systeme</dt><dd><ul class="org-ul">
<li>Zentralisierung bestimmter Dienste auf dedizierten Rechnern (server)</li>
<li>neue Betriebssystemkonzepte für Netzwerknutzung erforderlich</li>
</ul></dd>
<dt>1990 &#x2013; Cluster-Systeme</dt><dd><ul class="org-ul">
<li>auch <i>Verteilte Systeme</i></li>
<li>mehrere Rechner bzw. Multiprozessorsysteme teilen sich die Dienstserbringung</li>
<li>zur Erhöhung von Leistung und Ausfallsicherheit</li>
<li>Load Balancing Cluster / Serverfarmen</li>
<li>High Performance Computing (HPC) Cluster
<ul class="org-ul">
<li>Geschwindigkeitssteigerung durch Parallelisierung von Aufgaben</li>
<li>bei Ausfall eines Systems übernimmt ein anderes Cluster-Mitglied
dessen Aufgaben</li>
</ul></li>
</ul></dd>
<dt>1995 &#x2013; Peer-to-Peer-Systeme</dt><dd><ul class="org-ul">
<li>jede Maschine kann Client und Server sein</li>
<li>höhere Ausfallsicherheit</li>
</ul></dd>
<dt>2005 &#x2013; Cloud-Systeme oder Cloud-Computing</dt><dd><ul class="org-ul">
<li>Rezentralisierung der Rechenleistung durch Virtualisierung</li>
<li>Zugriff auf Ressourcen über Internet oder Intranet</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgc930a2f" class="outline-3">
<h3 id="orgc930a2f">&#x2026; der Technologie</h3>
<div class="outline-text-3" id="text-orgc930a2f">
<p>
&#x2026; der Prozessoren und Speicherchips
</p>
<ul class="org-ul">
<li>Mooresches Gesetz von 1965: Verdoppelung der Anzahl der Transistoren
auf einem Chip ca. alle 18 Monate &#x2013; gilt noch heute</li>
<li>Entwicklung der Mikroprozessoren am Beispiel von Intel
<ul class="org-ul">
<li>1971: Intel 4004, Transistoren: 2300, Taktrate: 108 kHz</li>
<li>1999: Pentium III, Transistoren: 9.500.000, Taktrate: bis 1 GHz</li>
<li>2000 bis 2008: Pentium 4, Transistoren: 42.000.000, Taktrate: bis
3,8 GHz</li>
</ul></li>
<li>Speicherkapazität pro Chip
<ul class="org-ul">
<li>1970: 1 Kilobit</li>
<li>heute: 1 Gigabit</li>
</ul></li>
<li>Preisverfall bei MIPS und Kosten pro Bit</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2f39c46" class="outline-2">
<h2 id="org2f39c46">Rechnerarchitekturen für parallele und verteilte Systeme</h2>
<div class="outline-text-2" id="text-org2f39c46">
<p>
(vgl.  <a class='org-ref-reference' href="#Bengel2015">Bengel2015</a>, <a class='org-ref-reference' href="#Kalin2015">Kalin2015</a>)
</p>
</div>
<div id="outline-container-org1ec2fbe" class="outline-3">
<h3 id="org1ec2fbe">Taxonomie von parallelen Rechnerarchitekturen nach Flynn</h3>
<div class="outline-text-3" id="text-org1ec2fbe">
<p>
(vgl. <a class='org-ref-reference' href="#Flynn1972">Flynn1972</a>)
</p>
<ul class="org-ul">
<li>Anmerkungen:
<ul class="org-ul">
<li>Die Taxonomie sagt nichts darüber aus, ob die Architektur ein
einzelnes oder ein verteiltes System beschreibt.</li>
<li>TDie Taxonomie ist schon recht alt, wird aber als Referenz nach
wie vor benutzt.</li>
</ul></li>
<li>Abkürzungen:<br />
D = Daten<br />
I = Befehle (Instruktionen)<br />
P = Prozessor<br />
S steht für <i>single</i>, M für <i>multiple</i>.
<ul class="org-ul">
<li>Parallelität im Sinne dieser Taxonomie erfordert immer mehrere
Prozessoren (P).</li>
</ul></li>
</ul>
<dl class="org-dl">
<dt>SISD: single instruction, single data</dt><dd><ul class="org-ul">
<li>keine Form von Parallelität</li>
</ul></dd>
</dl>
<pre class="example">
   +----------+    +---+    +----------+
   | D source |---&gt;| P |&lt;---| I source |                 
   +----------+    +---+    +----------+
</pre>
<dl class="org-dl">
<dt>SIMD: single instruction, multiple data</dt><dd><ul class="org-ul">
<li>Unterstützung in verschiedenen Programmiersprachen</li>
<li>heutzutage besonders relevant</li>
</ul></dd>
</dl>
<pre class="example">
   +----------+    +---+
   | D source |---&gt;| P |&lt;---+
   +----------+    +---+    |
   +----------+    +---+    |  +----------+
   | D source |---&gt;| P |&lt;---+--| I source |               
   +----------+    +---+    |  +----------+
   +----------+    +---+    |
   | D source |---&gt;| P |&lt;---+
   +----------+    +---+
</pre>
<dl class="org-dl">
<dt>MISD: multiple instruction, single data</dt><dd><ul class="org-ul">
<li>kaum praktische Bedeutung</li>
</ul></dd>
</dl>
<pre class="example">
                      +---+    +----------+
                 +---&gt;| P |&lt;---| I source |
                 |    +---+    +----------+
   +----------+  |    +---+    +----------+
   | D source |--+---&gt;| P |&lt;---| I source |               
   +----------+  |    +---+    +----------+ 
                 |    +---+    +----------+
                 +---&gt;| P |&lt;---| I source | 
                      +---+    +----------+
</pre>
<dl class="org-dl">
<dt>MIMD: multiple instruction, multiple data</dt><dd><ul class="org-ul">
<li>am ehesten in verteilten Systemen anzutreffen</li>
</ul></dd>
</dl>
<pre class="example">
   +----------+    +---+    +----------+
   | D source |---&gt;| P |&lt;---| I source |
   +----------+    +---+    +----------+
   +----------+    +---+    +----------+
   | D source |---&gt;| P |&lt;---| I source |                  
   +----------+    +---+    +----------+
   +----------+    +---+    +----------+
   | D source |---&gt;| P |&lt;---| I source |
   +----------+    +---+    +----------+
</pre>
</div>
</div>

<div id="outline-container-org483e8ed" class="outline-3">
<h3 id="org483e8ed">Ausprägungen</h3>
<div class="outline-text-3" id="text-org483e8ed">
</div><div id="outline-container-org2325de6" class="outline-4">
<h4 id="org2325de6">Eng gekoppelte Multiprozessoren und Multicore-Prozessoren</h4>
<div class="outline-text-4" id="text-org2325de6">
<ul class="org-ul">
<li>mehrere Prozesse können <i>echt</i> parallel ablaufen (auf
Einprozessorsystemen hingegen nur Quasi-Parallelität)</li>
<li>gemeinsamer Hauptspeicher</li>
</ul>
</div>
</div>
<div id="outline-container-orgac03725" class="outline-4">
<h4 id="orgac03725">Vektorrechner</h4>
<div class="outline-text-4" id="text-orgac03725">
<ul class="org-ul">
<li>Ausführung einer Berechnung gleichzeitig auf vielen Daten</li>
<li>Anordnung der Daten als Vektor bzw. Matrix</li>
<li>Beispiel für SIMD-Architektur</li>
<li>High-Performance-Computing</li>
<li>bekannt geworden ursprünglich durch Cray-Supercomputer (seit 1978)</li>
<li>genutzt z. B. für Simulationen (Meteorologie)</li>
</ul>
</div>
</div>
<div id="outline-container-org9abdabb" class="outline-4">
<h4 id="org9abdabb">General Purpose Computation on Graphic Processing Unit (GPGPU)</h4>
<div class="outline-text-4" id="text-org9abdabb">
<ul class="org-ul">
<li>ursprünglich bestehend aus beschränkt programmierbaren
Spezialprozessoren für Fließkommaoperationen</li>
<li>inzwischen frei programmierbare Prozessoren (tausende von Kernen),
dadurch</li>
<li>nutzbar nicht nur für Grafikanwendungen</li>
<li>Verwendbarkeit in höheren Programmiersprachen durch spezielle
Bibliotheken wie z. B. CUDA von Nvidia</li>
<li>Beispiel für SIMD-Architektur</li>
</ul>
</div>
</div>
