Vorlesung/ParProg-Grundlagen.html
<div id="outline-container-orgc9632ed" class="outline-4">
<h4 id="orgc9632ed">Lose gekoppelte Multiprozessoren</h4>
<div class="outline-text-4" id="text-orgc9632ed">
<ul class="org-ul">
<li>kein gemeinsamer Speicher</li>
<li>Synchronisation und Kommunikation durch Nachrichtenaustausch</li>
<li>Ziele: Erhöhung der Leistung, Erhöhung der Verfügbarkeit</li>
<li>MIMD möglich</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbd677ab" class="outline-2">
<h2 id="orgbd677ab">Parallelität vs. Nebenläufigkeit &#x2013; Überblick</h2>
<div class="outline-text-2" id="text-orgbd677ab">
</div>
<div id="outline-container-org3615c83" class="outline-3">
<h3 id="org3615c83">Concurrency, parallelism, and non-blocking I/O: an overview</h3>
<div class="outline-text-3" id="text-org3615c83">
<ul class="org-ul">
<li>For now, concurrency is "handling many tasks during the same time span":
<ul class="org-ul">
<li>Any app with a GUI (e.g., a game) needs to manage the GUI and perform the underlying logic.</li>
<li>A typical network app queues up requests, which then need to be handled concurrently.</li>
</ul></li>
<li>For now, (true) parallelism is "processing many tasks literally at the same time."
<ul class="org-ul">
<li>The tasks in a concurrent app would be farmed out to separate processors for true parallelism.</li>
<li>True parallelism requires multiple processors.
<ul class="org-ul">
<li>Multiprocessor machines now are available at consumer prices.</li>
</ul></li>
</ul></li>
<li>Two 'classic' mechanisms for concurrency: multiprocessing and multithreading.
<ul class="org-ul">
<li>Each mechanism supports true parallelism on a multiprocessor machine.</li>
</ul></li>
<li>Non-blocking I/O enables quick jumps from one I/O task to another, thereby supporting
concurrency without parallelism.
<ul class="org-ul">
<li>Non-blocking I/O typically is used in conjunction with  a 'classic' approach:
<ul class="org-ul">
<li>The nginx web server: multiprocessing + non-blocking I/O</li>
<li>Node.js: non-blocking I/O at the API level, multithreading under the hood.</li>
</ul></li>
</ul></li>
<li>Summary
<ul class="org-ul">
<li>Concurrency is a requirement for many modern apps, and there are various ways to enable it.</li>
<li>Parallelism boosts performance by increasing throughput: more work done in a given amount of time.
<ul class="org-ul">
<li>Concurrent tasks can be executed in parallel on a multiprocessor machine.</li>
</ul></li>
<li>Non-blocking I/O is used mostly in combination with multiprocessing or multithreading</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8e6a391" class="outline-3">
<h3 id="org8e6a391">Concurrency and parallelism: working technical definitions</h3>
<div class="outline-text-3" id="text-org8e6a391">
<pre class="example">
      client requests  +------------+   ## Task1: handle request1
    ------------------&gt;| web server |   ## Task2: handle request2
                       +------------+      ...
</pre>

<dl class="org-dl">
<dt>1st scenario</dt><dd><p>
a single-processor machine with time-sliced scheduling 
</p>
<ul class="org-ul">
<li>Assume each task is scheduled for a fixed-length time slice, and
then is pre-empted and rescheduled if its processing exceeds that
time slice.</li>
</ul>
<pre class="example">
               Time span (TS) = Start to Finish
Start time                                         Finish time
         |                                         |
         +-----------------------------------------+   ## each star * is one 
          \             /\         /\             /       system-clock tick
           ****Task1****  **Task2**  ****Task1****     ## Task1 (16 ticks) and Task2 
                                                         (4 ticks) share the processor
</pre>

<ul class="org-ul">
<li>Task1 and Task2 are processed concurrently during time span TS: their processing overlaps during TS.
<ul class="org-ul">
<li>Task1 and Task2 are not processed in parallel, as there's but a single processor that must be shared.</li>
</ul></li>
<li>1st scenario exhibits concurrency, but not true parallelism.</li>
</ul></dd>

<dt>2nd scenario</dt><dd><p>
a multi-processor machine (assume two for simplicity)
</p>
<pre class="example">
                 Time span 
Start time                       Finish time
         |                       |
         +-----------------------+
          \                     /
           ********Task1********      ### Executing on processor1
		   \         /
		    **Task2**         ### Executing on processor2
</pre>

<ul class="org-ul">
<li>Task1 and Task2 again are processed concurrently (during the same time span TS).</li>
<li>Task1 and Task2 also are processed in parallel for a while&#x2013;for 4
ticks (Task2's processing time).</li>
<li>The machine's throughput is improved: Task1 and Task2 both
complete within 16 time units, the time taken to process Task1,
the longer of the two.
<ul class="org-ul">
<li>1st scenario requires 20 clock ticks (each 1 time unit) to complete the two tasks.</li>
<li>2nd scenario requires 16 clock ticks to complete the two tasks, a 20% improvement.</li>
</ul></li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-org25ec746" class="outline-3">
<h3 id="org25ec746">System call overview for concurrency, parallelism, and non-blocking I/O</h3>
<div class="outline-text-3" id="text-org25ec746">
<ul class="org-ul">
<li><p>
The systems context: user-space and kernel-space code
</p>
<ul class="org-ul">
<li>User-space code does not control shared physical resources (processors, memory, I/O devices).
<ul class="org-ul">
<li>Ordinary applications execute in user space.</li>
</ul></li>
<li>Kernel-space code comprises the core OS routines that control shared physical resources.</li>
<li>A "system call" originates in user-space, but results in the execution of a kernel-space routine.
<ul class="org-ul">
<li>Standard library functions (user-space) mediate between ordinary
application code and the core OS routines (kernel-space) that
some library functions call.</li>
<li>The standard library goes by various names: on Unix-type
systems, libc or variants thereof (e.g., glibc on Ubuntu); on
Windows, the Windows API or variants thereof (e.g., Win32 API)</li>
</ul></li>
<li>Depiction: Node.js app calls the cluster.fork() function</li>
</ul>
<pre class="example">
                                                            system call
                                                 user space&lt;----+----&gt;kernel space
                                                                |
            calls                 calls                         | calls
Node.js app-------&gt;cluster.fork()-------&gt;library function fork()|-------&gt;kernel routine 
                                                                |     ## in Unix: fork
                                                                |     ## in Linux: clone
</pre></li>
<li>Importance of C: The standard libraries and kernel routines are
written mostly in C, with some assembly language or non-standard
C extensions covering the rest.</li>
</ul>
</div>
</div>
<div id="outline-container-org6b97a9a" class="outline-3">
<h3 id="org6b97a9a">Wrapup of the overview</h3>
<div class="outline-text-3" id="text-org6b97a9a">
<ul class="org-ul">
<li>Concurrency and parallelism are different.
<ul class="org-ul">
<li>Concurrency involves handling multiple tasks in the same time span.</li>
<li>Parallelism involves processing multiple tasks literally at the same time.
<ul class="org-ul">
<li>True parallelism requires multiple processors.</li>
</ul></li>
<li>Parallelism is a performance-boosting way to manage concurrency.</li>
</ul></li>
<li>The classic approaches to concurrency are multiprocessing and multithreading.
<ul class="org-ul">
<li>Non-blocking I/O has emerged as an option as well, but one that's
typically used in conjunction with multiprocessing or
multithreading.</li>
<li>Non-blocking I/O sometimes is described as 'concurrency without parallelism'.</li>
</ul></li>
<li>Different languages have difference advantages when it comes to
studying concurrency, parallelism, and non-blocking I/O.
<ul class="org-ul">
<li>C is close to the metal: the system libraries and core OS routines at work under the hood.</li>
<li>Whatever the application language, multiprocessing,
multithreading, and non-blocking I/O calls in the language hit the
C libraries and, from there, kernel-space routines.</li>
<li>Java (C#), Go, Node.js and other languages have particular styles
and strengths with respect to concurrency in particular.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgde48bb9" class="outline-2">
<h2 id="orgde48bb9">Parallelität vs. Nebenläufigkeit im Detail</h2>
