Vorlesung/ParProg-Grundlagen.org
** Processes and threads 
# chapter 2: processThread.txt
+ A process is a /program in execution/, each with its own address space.
  + Executing a program from the command-line is an example:
      =% hi.exe=
    + =%= is the command-line prompt, =hi.exe= is an executable program.
  + The address space comprises the memory locations accessible to the process.
  + Separate address spaces effectively partition memory among the processes.
+ A thread is a sequence of executable instructions within a process.
  + A 1-instruction thread is trivial, and threads made up of tens of
     instructions are more typical.
  + A single-threaded process has one thread, whereas a multithreaded process has multiple ones.
  + Although there are different ways to implement threads (more on this later), the
     critical point is this:
    + Threads within a process share the same address space--they have
      access to exactly the same memory locations. This is the root
      cause of race conditions.
    + A /race condition/ arises when two or more threads concurrently
      access the same memory location and at least one of the threads
      tries to update the location. For instance, each thread might be
      executing the instruction:\\
         =n = random_num()=
      + =n= is a shared memory location among the threads,
      + =random_num()= returns a random number
      + The result is unpredictable, except that the last thread to execute this „wins“.
+ Scheduling on modern systems: to schedule a process on a processor is to schedule one of its threads.
#+begin_example
  Process1    scheduled   +----------+
    Thread11------------->|processor3|
    Thread12              +----------+

  Process2
    Thread21
    Thread22  scheduled   +----------+
    Thread23------------->|processor7|
                          +----------+
#+end_example
** Multiprocessing
# chapter 2 multiprocessing.txt
A first look at multiprocessing: the command-line pipe operator =|=
+ At the command line:
  : cat file.txt | sort
  + The =cat= (short for =concatenate=) on the left is one executing
    process, and the =sort= on the right is another executing process.
  + The =sort= performs blocking I/O: it waits for all of the bytes
    from =cat= before doing the sorting.
  + If the machine has two processorss, =cat= could execute on one and =sort= on the other.
  + The unnamed pipe operator | thus performs automatic multiprocessing.
    + A pipe is thus a mechanism for inter-process communication (IPC).
+ Conceptual view of the pipe:
#+begin_example
                       pipe
               +--------|-------+
    writer---->|WriteEnd|ReadEnd|<----reader
               +--------+-------+
#+end_example
+ The tasks at hand (producing the bytes in the file and then sorting
  the lines) are divided between two processes, =cat= and =sort=.
+ Two general approaches in code:
  + A parent process „forks” (clones, spawns) a child process, and both
      execute code from the same program.	  
      + An if-else or the equivalent typically separates the parent code from the child code.
  + A parent process forks a child, which then executes a separate program.
+ A final example to underscore the point:
  : sleep 5 | echo 'Hello, world!'  ## sleep sends no bytes to the pipe, and echo expects none
  + Hello, world! appears on the screen, and roughly 5 seconds later the prompt returns from the sleep command.
** Multithreading
# chapter 2: multithreading.txt
A first look at multithreading: the Tomcat web server, written in Java

+ Tomcat implements the /one-thread-per-request/ model for handling client requests.
+ Tomcat runs as a single process, which is multithreaded.
+ Web sites and services are deployed as JAR files (with a .war
  extension) dropped into a particular directory (=TOMCAT_HOME/webapps=)
  or subdirectory thereof.
  + The WAR file's name (e.g., =site1= in =site1.war=) becomes the first part of /resource path(
      in a request URL:\\
      http://somemachine.org:8080/site1/...    ## site1 for the site1.war file\\
      http://somemachine.org:8080/site1/hi.jsp ## a completed URL, with hi.jsp as the requested resourc
  + Tomcat delegates each request for any WAR file to a thread, the /one-thread-per-request/ model
    + Code within the WAR file is thus susceptible to race conditions
      because multiple request-handling threads have access to the
      very same memory locations: the burden is on the programmer to
      ensure proper thread coordination.
+ For efficiency, Tomcat creates a thread pool at start-up: indeed, two thread pools--one for
   requests over HTTP, another for requests over HTTPS if HTTPS is enabled.
+ Other Java-centric web servers, such as Jetty, implement the one-thread-per-request model as well.
