Vorlesung/ParProg-Grundlagen.html
<div class="outline-text-2" id="text-orgde48bb9">
</div><div id="outline-container-org868b534" class="outline-3">
<h3 id="org868b534">Processes and threads</h3>
<div class="outline-text-3" id="text-org868b534">
<ul class="org-ul">
<li>A process is a 'program in execution', each with its own address space.
<ul class="org-ul">
<li>Executing a program from the command-line is an example:
<code>% hi.exe</code>  ## <code>%</code> is the command-line prompt, <code>hi.exe</code> is an executable program.</li>
<li>The address space comprises the memory locations accessible to the process.</li>
<li>Separate address spaces effectively partition memory among the processes.</li>
</ul></li>
<li>A thread is a sequence of executable instructions within a process.
<ul class="org-ul">
<li>A 1-instruction thread is trivial, and threads made up of tens of
instructions are more typical.</li>
<li>A single-threaded process has one thread, whereas a multithreaded process has multiple ones.</li>
<li>Although there are different ways to implement threads (more on this later), the
critical point is this:
<ul class="org-ul">
<li>Threads within a process share the same address space&#x2013;they have
access to exactly the same memory locations. This is the root
cause of race conditions.</li>
<li>A 'race condition' arises when two or more threads concurrently
access the same memory location and at least one of the threads
tries to update the location. For instance, each thread might be
executing the instruction:<br />
   <code>n = random_num()</code>  ## <code>n</code> is a shared memory location among the threads, random<sub>num</sub>() returns a random number<br />
   The result is unpredictable, except that the last thread to execute this 'wins'.</li>
</ul></li>
</ul></li>
<li>Scheduling on modern systems: to schedule a process on a processor is to schedule one of its threads.</li>
</ul>
<pre class="example">
  Process1    scheduled   +----------+
    Thread11-------------&gt;|processor3|
    Thread12              +----------+

  Process2
    Thread21
    Thread22  scheduled   +----------+
    Thread23-------------&gt;|processor7|
                          +----------+
</pre>
</div>
</div>
<div id="outline-container-orga8e50c4" class="outline-3">
<h3 id="orga8e50c4">Multiprocessing</h3>
<div class="outline-text-3" id="text-orga8e50c4">
<p>
A first look at multiprocessing: the command-line pipe operator <code>|</code>
</p>
<ul class="org-ul">
<li><p>
At the command line:
</p>
<pre class="example">
cat file.txt | sort

</pre>
<ul class="org-ul">
<li>The 'cat' (short for 'concatenate') on the left is one executing
process, and the 'sort' on the right is another executing process.</li>
<li>The 'sort' performs blocking I/O: it waits for all of the bytes
from 'cat' before doing the sorting.</li>
<li>If the machine has two processorss, 'cat' could execute on one and 'sort' on the other.</li>
<li>The unnamed pipe operator | thus performs automatic multiprocessing.
<ul class="org-ul">
<li>A pipe is thus a mechanism for inter-process communication (IPC).</li>
</ul></li>
</ul></li>
<li>Conceptual view of the pipe:</li>
</ul>
<pre class="example">
                       pipe
               +--------|-------+
    writer----&gt;|WriteEnd|ReadEnd|&lt;----reader
               +--------+-------+
</pre>
<ul class="org-ul">
<li>The tasks at hand (producing the bytes in the file and then sorting
the lines) are divided between two processes, 'cat' and 'sort'.</li>
<li>Two general approaches in code:
<ul class="org-ul">
<li>A parent process 'forks' (clones, spawns) a child process, and both
execute code from the same program.	  
<ul class="org-ul">
<li>An if-else or the equivalent typically separates the parent code from the child code.</li>
</ul></li>
<li>A parent process forks a child, which then executes a separate program.</li>
</ul></li>
<li><p>
A final example to underscore the point:
</p>
<pre class="example">
sleep 5 | echo 'Hello, world!'  ## sleep sends no bytes to the pipe, and echo expects none

</pre>
<ul class="org-ul">
<li>Hello, world! appears on the screen, and roughly 5 seconds later the prompt returns from the sleep command.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3f7bb81" class="outline-3">
<h3 id="org3f7bb81">Multithreading</h3>
<div class="outline-text-3" id="text-org3f7bb81">
<p>
A first look at multithreading: the Tomcat web server, written in Java
</p>

<ul class="org-ul">
<li>Tomcat implements the 'one-thread-per-request' model for handling client requests.</li>
<li>Tomcat runs as a single process, which is multithreaded.</li>
<li>Web sites and services are deployed as JAR files (with a .war
extension) dropped into a particular directory (TOMCAT<sub>HOME</sub>/webapps)
or subdirectory thereof.
<ul class="org-ul">
<li><p>
The WAR file's name (e.g., 'site1' in 'site1.war') becomes the first part of 'resource path'
in a request URL:<br />
</p>

<p>
<a href="http://somemachine.org:8080/site1/">http://somemachine.org:8080/site1/</a>&#x2026;    ## site1 for the site1.war file<br />
<a href="http://somemachine.org:8080/site1/hi.jsp">http://somemachine.org:8080/site1/hi.jsp</a> ## a completed URL, with hi.jsp as the requested resourc
</p></li>
<li>Tomcat delegates each request for any WAR file to a thread, the 'one-thread-per-request' model
<ul class="org-ul">
<li>Code within the WAR file is thus susceptible to race conditions
because multiple request-handling threads have access to the
very same memory locations: the burden is on the programmer to
ensure proper thread coordination.</li>
</ul></li>
</ul></li>
<li>For efficiency, Tomcat creates a thread pool at start-up: indeed, two thread pools&#x2013;one for
requests over HTTP, another for requests over HTTPS if HTTPS is enabled.</li>
<li>Other Java-centric web servers, such as Jetty, implement the one-thread-per-request model as well.</li>
</ul>
</div>
</div>
