Vorlesung/ParProg-Grundlagen.org
** Non-blocking I/O
# chapter 2: nonblocking.txt
A first look at non-blocking I/O non-blocking I/O: two code examples

+ A blocking =getItem= (read) example
#+BEGIN_SRC html
    <!doctype html>
    <html>
      <head>
        <title>Blocking I/O</title>
        <script>
          localStorage.name = 'Flintstone';             <!-- line 1 -->
          alert('Before blocking call');                <!-- line 2 -->
          var value = localStorage.getItem('name');     <!-- line 3 -->
          alert('After blocking call: ' + value);       <!-- line 4 -->
        </script>
      </head>
      <body/>
    </html>
#+END_SRC 
  + The second alert occurs only after the blocking call to 'getItem' (line 3) returns.

+ A non-blocking 'fetch' example in pseudo-code
#+BEGIN_SRC java
    define callbackFunction(Http-response) {
       productList = extractProductListFromResponse(Http-response)
       print(productList)                            ## print is blocking
    }

    // Main code 
    url = 'http://some-machine.org/some-script-to-get-data'
    connection = getConnectionToRemoteMachine(url)
    connection.fetch(callbackFunction)                   ## fetch(...) is non-blocking
    print('Hello, world!')                               ## print is blocking
    print('Goodbye, cruel world!')                       ## print is blocking
#+END_SRC
** Zusammenfassung 
 Three approaches to concurrency: multiprocessing, multithreading, non-blocking I/O

#+begin_example 
     client requests  +------------+   ## Task1: handle request1
   ------------------>| web server |   ## Task2: handle request2
                      +------------+      ...
#+end_example

+ Multiprocessing: dispatch each task to a separate process (/program
  in execution/)
  + For efficiency, "prefork" the processes by building a pool of these
   at start-up.  Then grab a process from the pool to act as the /task
   handler/.
  + When the task-handling process finishes its work, put it to sleep.
  + Apache2, nginx, and IIS are production-grade examples.
+ Multithreading: dispatch each task to a separate thread within a process.
  + Again for efficiency, build a thread-pool at start-up, and grab a
    thread from the pool to act as the /task handler/.
   + When the task-handling thread finishes its work, put it to sleep.
   + Tomcat and Jetty are production-grade examples.
+ Non-blocking I/O: in its pure form, a single-threaded process that
  jumps quickly from one task to another, perhaps doing only partial
  processing of each task.
  + For example, the non-blocking web server might read (and cache)
    some bytes as part of Task1, then do the same for Task2, and so on
    until all of the request bytes for a given task have been read.
   + Node.js is the obvious /pure/ example (but even Node.js takes a hybrid approach).
** Hybrid approaches
# chapter 2: hybrid.txt
+ There's no hard-and-fast rule about how best to support concurrency.
  + Multiprocessing, multithreading, and non-blocking I/O can be used
    in various combinations.
+ Sample hybrids
  + Multiprocessing + multithreading: IIS (Windows web server) and
    AspNet runtime
  #+begin_example
  client side                         server side
+-------------+  HTTP requests    +-----------------+
| web browser |------------------>| Web server (IIS)|
|             |<------------------|                 |
+-------------+  HTTP responses   +-------+---------+
                                          |
                                    aspnet_isapi.dll    ## Links IIS process with workers
                                          |
                                          +--- aspnet_wp.exe    ## worker process 1
                                          |
                                          +--- aspnet_wp.exe    ## worker process 2
                                          ...                   ...
  #+end_example
    + Each worker process is multithreaded (by default, 10 threads per
      worker process), and each thread handles a single request (the
      /one-thread-per-request/ model)
  + Multiprocessing + non-blocking I/O: nginx
    + Multiprocessing:
      + nginx has a /master process/ to read configuration files and
        to watch over worker processes (e.g., start a new worker if
        one happens to die unexpectedly).
      + A /worker process/ handles a client request: a given worker
        may handle even thousands of requests concurrently--given the
        efficiency of non-blocking I/O.
      + Other (optional) processes (e.g., a cache loader and a cache
        manager) also are in play.
      + Non-blocking I/O:
        + The workers employ non-blocking I/O in handling requests,
          each of which is partitioned into a collection of
          sub-requests. A completed sub-request generates an event,
          which is handled in the course of assembling a full response
          out of pieces.
  + Non-blocking I/O + multithreading (under the hood): Node.js
  #+begin_example
               Node.js server  ## a single-threaded process managing an event loop
client request  +--------+
--------------->|        |     ## 'workers' are JavaScript functions that read and
     ...        | event           otherwise handle a client's request using non-blocking 
client request  | loop   |        I/O and callbacks to signal task completion
--------------->|        |
                +--------+     ## Long-running tasks (e.g., accessing a DB) are delegated 
			          to under-the-hood threads, with callbacks to signal
                                  task completion
  #+end_example

* Multiprocessing -- Grundlagen
** A first multiprocessing example in C
