Vorlesung/ParProg-Grundlagen.html
<div id="outline-container-org04c0000" class="outline-3">
<h3 id="org04c0000">Non-blocking I/O</h3>
<div class="outline-text-3" id="text-org04c0000">
<p>
A first look at non-blocking I/O non-blocking I/O: two code examples
</p>

<ul class="org-ul">
<li>A blocking 'getItem' (read) example</li>
</ul>
<div class="org-src-container">
<pre class="src src-html">&nbsp;&nbsp;&nbsp;&nbsp;&lt;<span style="color: #0000FF;">!doctype</span> html&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;<span style="color: #006699;">html</span>&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;<span style="color: #006699;">head</span>&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;<span style="color: #006699;">title</span>&gt;<span style="color: #000000; font-weight: bold; text-decoration: underline;">Blocking I/O</span>&lt;/<span style="color: #006699;">title</span>&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;<span style="color: #006699;">script</span>&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;localStorage.name = 'Flintstone';&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span style="color: #8D8D84;">&lt;!-- </span><span style="color: #8D8D84; font-style: italic;">line 1 </span><span style="color: #8D8D84;">--&gt;</span><br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;alert('Before blocking call');&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="color: #8D8D84;">&lt;!-- </span><span style="color: #8D8D84; font-style: italic;">line 2 </span><span style="color: #8D8D84;">--&gt;</span><br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;var value = localStorage.getItem('name');&nbsp;&nbsp;&nbsp;&nbsp; <span style="color: #8D8D84;">&lt;!-- </span><span style="color: #8D8D84; font-style: italic;">line 3 </span><span style="color: #8D8D84;">--&gt;</span><br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;alert('After blocking call: ' + value);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span style="color: #8D8D84;">&lt;!-- </span><span style="color: #8D8D84; font-style: italic;">line 4 </span><span style="color: #8D8D84;">--&gt;</span><br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;/<span style="color: #006699;">script</span>&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;/<span style="color: #006699;">head</span>&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;<span style="color: #006699;">body</span>/&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;/<span style="color: #006699;">html</span>&gt;</p>
</pre>
</div>
<ul class="org-ul">
<li>The second alert occurs only after the blocking call to 'getItem' (line 3) returns.</li>
</ul>
<ul class="org-ul">
<li>A non-blocking 'fetch' example in pseudo-code</li>
</ul>
<div class="org-src-container">
<pre class="src src-java">    <span style="color: #6434A3;">define</span> <span style="color: #006699;">callbackFunction</span><span style="color: #707183;">(</span>Http-response<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
       productList = extractProductListFromResponse<span style="color: #7388D6;">(</span>Http-response<span style="color: #7388D6;">)</span>
       print<span style="color: #7388D6;">(</span>productList<span style="color: #7388D6;">)</span>                            ## print is blocking
    <span style="color: #707183;">}</span>

    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Main code </span>
    url = <span style="color: #008000;">'http://some-machine.org/some-script-to-get-data'</span>
    connection = getConnectionToRemoteMachine<span style="color: #707183;">(</span>url<span style="color: #707183;">)</span>
    connection.fetch<span style="color: #707183;">(</span>callbackFunction<span style="color: #707183;">)</span>                   ## fetch<span style="color: #707183;">(</span>...<span style="color: #707183;">)</span> is non-blocking
    print<span style="color: #707183;">(</span><span style="color: #008000;">'Hello, world!'</span><span style="color: #707183;">)</span>                               ## print is blocking
    print<span style="color: #707183;">(</span><span style="color: #008000;">'Goodbye, cruel world!'</span><span style="color: #707183;">)</span>                       ## print is blocking</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbabac52" class="outline-3">
<h3 id="orgbabac52">Zusammenfassung</h3>
<div class="outline-text-3" id="text-orgbabac52">
<p>
Three approaches to concurrency: multiprocessing, multithreading, non-blocking I/O
</p>

<pre class="example">
     client requests  +------------+   ## Task1: handle request1
   ------------------&gt;| web server |   ## Task2: handle request2
                      +------------+      ...
</pre>

<ul class="org-ul">
<li>Multiprocessing: dispatch each task to a separate process ('program
in execution')
<ul class="org-ul">
<li>For efficiency, "prefork" the processes by building a pool of these
at start-up.  Then grab a process from the pool to act as the 'task
handler'.</li>
<li>When the task-handling process finishes its work, put it to sleep.</li>
<li>Apache2, nginx, and IIS are production-grade examples.</li>
</ul></li>
<li>Multithreading: dispatch each task to a separate thread within a process.
<ul class="org-ul">
<li>Again for efficiency, build a thread-pool at start-up, and grab a
thread from the pool to act as the 'task handler'.
<ul class="org-ul">
<li>When the task-handling thread finishes its work, put it to sleep.</li>
<li>Tomcat and Jetty are production-grade examples.</li>
</ul></li>
</ul></li>
<li>Non-blocking I/O: in its pure form, a single-threaded process that
jumps quickly from one task to another, perhaps doing only partial
processing of each task.
<ul class="org-ul">
<li>For example, the non-blocking web server might read (and cache)
some bytes as part of Task1, then do the same for Task2, and so on
until all of the request bytes for a given task have been read.
<ul class="org-ul">
<li>Node.js is the obvious 'pure' example (but even Node.js takes a hybrid approach).</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org476ae62" class="outline-3">
<h3 id="org476ae62">Hybrid approaches</h3>
<div class="outline-text-3" id="text-org476ae62">
<ul class="org-ul">
<li>There's no hard-and-fast rule about how best to support concurrency.
<ul class="org-ul">
<li>Multiprocessing, multithreading, and non-blocking I/O can be used
in various combinations.</li>
</ul></li>
<li><p>
Sample hybrids
</p>
<ul class="org-ul">
<li>Multiprocessing + multithreading: IIS (Windows web server) and
AspNet runtime</li>
</ul>
<pre class="example">
  client side                         server side
+-------------+  HTTP requests    +-----------------+
| web browser |------------------&gt;| Web server (IIS)|
|             |&lt;------------------|                 |
+-------------+  HTTP responses   +-------+---------+
                                          |
                                    aspnet_isapi.dll    ## Links IIS process with workers
                                          |
                                          +--- aspnet_wp.exe    ## worker process 1
                                          |
                                          +--- aspnet_wp.exe    ## worker process 2
                                          ...                   ...
</pre>
<ul class="org-ul">
<li>Each worker process is multithreaded (by default, 10 threads per
worker process), and each thread handles a single request (the
'one-thread-per-request' model)</li>
</ul>
<ul class="org-ul">
<li>Multiprocessing + non-blocking I/O: nginx
<ul class="org-ul">
<li>Multiprocessing:
<ul class="org-ul">
<li>nginx has a 'master process' to read configuration files and
to watch over worker processes (e.g., start a new worker if
one happens to die unexpectedly).</li>
<li>A 'worker process' handles a client request: a given worker
may handle even thousands of requests concurrently&#x2013;given the
efficiency of non-blocking I/O.</li>
<li>Other (optional) processes (e.g., a cache loader and a cache
manager) also are in play.</li>
<li>Non-blocking I/O:
<ul class="org-ul">
<li>The workers employ non-blocking I/O in handling requests,
each of which is partitioned into a collection of
sub-requests. A completed sub-request generates an event,
which is handled in the course of assembling a full response
out of pieces.</li>
</ul></li>
</ul></li>
</ul></li>
<li>Non-blocking I/O + multithreading (under the hood): Node.js</li>
</ul>
<pre class="example">
               Node.js server  ## a single-threaded process managing an event loop
client request  +--------+
---------------&gt;|        |     ## 'workers' are JavaScript functions that read and
     ...        | event           otherwise handle a client's request using non-blocking 
client request  | loop   |        I/O and callbacks to signal task completion
---------------&gt;|        |
                +--------+     ## Long-running tasks (e.g., accessing a DB) are delegated 
			          to under-the-hood threads, with callbacks to signal
                                  task completion
</pre></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdf147a7" class="outline-2">
<h2 id="orgdf147a7">Multiprocessing &#x2013; Grundlagen</h2>
