Vorlesung/ParProg-Grundlagen.html
<div class="outline-text-2" id="text-orgdf147a7">
</div><div id="outline-container-org157a6e6" class="outline-3">
<h3 id="org157a6e6">A first multiprocessing example in C</h3>
<div class="outline-text-3" id="text-org157a6e6">
</div><div id="outline-container-org526b75c" class="outline-4">
<h4 id="org526b75c">Overview</h4>
<div class="outline-text-4" id="text-org526b75c">
<p>
&#x2026; key points of the 'unnamed pipe example'
</p>

<ul class="org-ul">
<li><p>
When the program pipeExample.c is compiled and then executed from
the command-line, it executes as a process. Here's the command to
execute:
</p>
<pre class="example">
% ./pipeExample   ## On Windows: % pipeExample

</pre></li>
<li>The executing pipeExample is the 'parent' process.</li>
<li>The parent process calls the library function fork() to spawn a
'child' process, a clone of the parent.
<ul class="org-ul">
<li>The library function fork() makes a system call to the OS routine that spawns the child.</li>
<li>The library function fork() returns one of three values:
<dl class="org-dl">
<dt>-1</dt><dd>to signal failure (e.g., the system already has too
many processes)</dd>
<dt>0</dt><dd>to the child process</dd>
<dt>&gt; 0</dt><dd>to the parent process; in particular, the 'process id'
(pid) of the child is returned to the parent, and a pid
is always a positive integer</dd>
</dl></li>
<li>The parent and child process both execute the code that follows the call to fork().
<ul class="org-ul">
<li>fork() effectively 'clones' one process (child) from another (parent).</li>
<li><p>
An if-else or equivalent construct is used to ensure that the
parent does one thing and the child does something else.
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #6434A3;">pid_t</span> <span style="color: #BA36A5;">pid</span> = fork<span style="color: #707183;">()</span>;   <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">pid_t is a signed integer data type *</span><span style="color: #8D8D84;">*/</span>
<span style="color: #0000FF;">if</span> <span style="color: #707183;">(</span>-1 == pid<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>      <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">error: couldn't clone a new process *</span><span style="color: #8D8D84;">*/</span>
    ...                
<span style="color: #707183;">}</span>   
<span style="color: #0000FF;">else</span> <span style="color: #0000FF;">if</span> <span style="color: #707183;">(</span>0 == pid<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>  <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">child code follows *</span><span style="color: #8D8D84;">*/</span>
    ...
<span style="color: #707183;">}</span>
<span style="color: #0000FF;">else</span> <span style="color: #707183;">{</span>                <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">parent code follows *</span><span style="color: #8D8D84;">*/</span>
    ...
<span style="color: #707183;">}</span></pre>
</pre>
</div></li>
</ul></li>
<li>The parent waits for the child to exit so that the child does not
become a 'zombie'.
<ul class="org-ul">
<li>When a child terminates, the OS notifies the parent. If the
parent is already terminated, it cannot be notified&#x2013;and the
child becomes an 'zombie', dead but still around.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3b441d3" class="outline-4">
<h4 id="org3b441d3">using the shell</h4>
<div class="outline-text-4" id="text-org3b441d3">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ ls pipeExample.c 
pipeExample.c
bash-3.2$ gcc -o pipeExample pipeExample.c 
bash-3.2$ ./pipeExample
This is the winter of our discontent
bash-3.2$ </pre>
</pre>
</div>
</div>
</div>
