Vorlesung/ParProg-Grundlagen.org
*** Source code
#+BEGIN_SRC C
/** A first multiprocessing example: pipes in C 
    To compile (Unix-like system): gcc -o pipeExample pipeExample.c
    For Windows, the GNU compiler: https://gcc.gnu.org/
**/
#include <sys/wait.h>
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <string.h>

#define ReadEnd  0                                                  /** line 1 **/            
#define WriteEnd 1                                                

void report_and_die(const char* msg) {                              /** line 2 **/
  perror(msg);
  exit(-1);    /** failure **/
}

int main() {
  int pipeFDs[2];                                                   /** line 3 **/
  char buf;         /* 1-byte buffer */
  const char* msg = "This is the winter of our discontent\n";

  if (pipe(pipeFDs) < 0) report_and_die("pipe(...)");               /** line 4 **/

  pid_t cpid = fork();                                              /** line 5 **/
  if (cpid < 0) report_and_die("fork()");                           /** line 6 **/

  /*** child ***/
  if (0 == cpid) {                                                  /** line 7 **/
    close(pipeFDs[WriteEnd]);                                       /** line 8 **/
    while (read(pipeFDs[ReadEnd], &buf, 1) > 0)                     /** line 9 **/
      write(STDOUT_FILENO, &buf, sizeof(buf));                      /** 1ine 10 **/
    close(pipeFDs[ReadEnd]);                                        /** line 11 **/
    _exit(0); /* signal parent of immediate exit **/                /** line 12 **/
  } 
  /*** parent ***/
  else {                                                            /** line 13 **/ 
    close(pipeFDs[ReadEnd]);                                   
    write(pipeFDs[WriteEnd], msg, strlen(msg));                     /** line 14 **/
    close(pipeFDs[WriteEnd]); /* generates an EOF */                /** line 15 **/
    wait(0); /*** wait for child to exit ***/                       /** line 16 **/  
    exit(0); /* exit normally */                                    /** line 17 **/
  }
  return 0;
}
#+END_SRC
** Second Example -- Named Pipes
*** Overview
# chapter 3 secondExample.txt
 A second multiprocessing example in C: key points of the /named pipe/ example

+ Two separate processes, but no parent/child relationship between them.
  + The processes communicate through a /named pipe/ (aka /FIFO/).
    + A named pipe is a mechanism designed to support IPC among processes on the same host.
      #+begin_example
           +------------+
writer---->| named pipe |<----reader
           +------------+
      #+end_example
+ The system implements an FIFO as a temporary file.
+ Named pipes are quite similar in functionality to Unix Domain
  Sockets, also called /local sockets/.
  + Network sockets support communcation between processes running on
    different hosts, whereas named pipes and local sockets do the same
    for processes running on the same host.
+ The example consists of two executable programs, fifoWriter and
  fifoReader, which can be executed at the command-line as follows:
  : % ./fifoWriter &    ## for Windows: fifoWriter & (& puts the process in the background) 
  : % ./fifoReader      ## for Windows: fifoReader
  + There are now two processes executing: fifoWriter and fifoReader
  + The fifoWriter writes randomly generated integers to the FIFO.
  + The fifoReader reads these integers from the FIFO until end-of-file.
  + In the C code, the FIFO is /written/ and /read/ as if it were a
    regular disk file: the I/O API is the same.
