Vorlesung/ParProg-Grundlagen.html
<div id="outline-container-org02ae615" class="outline-4">
<h4 id="org02ae615">Source code</h4>
<div class="outline-text-4" id="text-org02ae615">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">A first multiprocessing example: pipes in C </span>
<span style="color: #8D8D84; font-style: italic;">    To compile (Unix-like system): gcc -o pipeExample pipeExample.c</span>
<span style="color: #8D8D84; font-style: italic;">    For Windows, the GNU compiler: https://gcc.gnu.org/</span>
<span style="color: #8D8D84; font-style: italic;">*</span><span style="color: #8D8D84;">*/</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">sys/wait.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdio.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdlib.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">unistd.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">string.h</span><span style="color: #707183;">&gt;</span>

<span style="color: #808080;">#define</span> <span style="color: #BA36A5;">ReadEnd</span>  0                                                  <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 1 *</span><span style="color: #8D8D84;">*/</span>            
<span style="color: #808080;">#define</span> <span style="color: #BA36A5;">WriteEnd</span> 1                                                

<span style="color: #6434A3;">void</span> <span style="color: #006699;">report_and_die</span><span style="color: #707183;">(</span><span style="color: #0000FF;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">msg</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>                              <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 2 *</span><span style="color: #8D8D84;">*/</span>
  perror<span style="color: #7388D6;">(</span>msg<span style="color: #7388D6;">)</span>;
  exit<span style="color: #7388D6;">(</span>-1<span style="color: #7388D6;">)</span>;    <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">failure *</span><span style="color: #8D8D84;">*/</span>
<span style="color: #707183;">}</span>

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">pipeFDs</span><span style="color: #7388D6;">[</span>2<span style="color: #7388D6;">]</span>;                                                   <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 3 *</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #6434A3;">char</span> <span style="color: #BA36A5;">buf</span>;         <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">1-byte buffer </span><span style="color: #8D8D84;">*/</span>
  <span style="color: #0000FF;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">msg</span> = <span style="color: #008000;">"This is the winter of our discontent\n"</span>;

  <span style="color: #0000FF;">if</span> <span style="color: #7388D6;">(</span>pipe<span style="color: #909183;">(</span>pipeFDs<span style="color: #909183;">)</span> &lt; 0<span style="color: #7388D6;">)</span> report_and_die<span style="color: #7388D6;">(</span><span style="color: #008000;">"pipe(...)"</span><span style="color: #7388D6;">)</span>;               <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 4 *</span><span style="color: #8D8D84;">*/</span>

  <span style="color: #6434A3;">pid_t</span> <span style="color: #BA36A5;">cpid</span> = fork<span style="color: #7388D6;">()</span>;                                              <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 5 *</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #0000FF;">if</span> <span style="color: #7388D6;">(</span>cpid &lt; 0<span style="color: #7388D6;">)</span> report_and_die<span style="color: #7388D6;">(</span><span style="color: #008000;">"fork()"</span><span style="color: #7388D6;">)</span>;                           <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 6 *</span><span style="color: #8D8D84;">*/</span>

  <span style="color: #8D8D84;">/*** </span><span style="color: #8D8D84; font-style: italic;">child **</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #0000FF;">if</span> <span style="color: #7388D6;">(</span>0 == cpid<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>                                                  <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 7 *</span><span style="color: #8D8D84;">*/</span>
    close<span style="color: #909183;">(</span>pipeFDs<span style="color: #709870;">[</span>WriteEnd<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;                                       <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 8 *</span><span style="color: #8D8D84;">*/</span>
    <span style="color: #0000FF;">while</span> <span style="color: #909183;">(</span>read<span style="color: #709870;">(</span>pipeFDs<span style="color: #907373;">[</span>ReadEnd<span style="color: #907373;">]</span>, &amp;buf, 1<span style="color: #709870;">)</span> &gt; 0<span style="color: #909183;">)</span>                     <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 9 *</span><span style="color: #8D8D84;">*/</span>
      write<span style="color: #909183;">(</span>STDOUT_FILENO, &amp;buf, <span style="color: #0000FF;">sizeof</span><span style="color: #709870;">(</span>buf<span style="color: #709870;">)</span><span style="color: #909183;">)</span>;                      <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">1ine 10 *</span><span style="color: #8D8D84;">*/</span>
    close<span style="color: #909183;">(</span>pipeFDs<span style="color: #709870;">[</span>ReadEnd<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;                                        <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 11 *</span><span style="color: #8D8D84;">*/</span>
    _exit<span style="color: #909183;">(</span>0<span style="color: #909183;">)</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">signal parent of immediate exit *</span><span style="color: #8D8D84;">*/</span>                <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 12 *</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #7388D6;">}</span> 
  <span style="color: #8D8D84;">/*** </span><span style="color: #8D8D84; font-style: italic;">parent **</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #0000FF;">else</span> <span style="color: #7388D6;">{</span>                                                            <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 13 *</span><span style="color: #8D8D84;">*/</span> 
    close<span style="color: #909183;">(</span>pipeFDs<span style="color: #709870;">[</span>ReadEnd<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;                                   
    write<span style="color: #909183;">(</span>pipeFDs<span style="color: #709870;">[</span>WriteEnd<span style="color: #709870;">]</span>, msg, strlen<span style="color: #709870;">(</span>msg<span style="color: #709870;">)</span><span style="color: #909183;">)</span>;                     <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 14 *</span><span style="color: #8D8D84;">*/</span>
    close<span style="color: #909183;">(</span>pipeFDs<span style="color: #709870;">[</span>WriteEnd<span style="color: #709870;">]</span><span style="color: #909183;">)</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">generates an EOF </span><span style="color: #8D8D84;">*/</span>                <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 15 *</span><span style="color: #8D8D84;">*/</span>
    wait<span style="color: #909183;">(</span>0<span style="color: #909183;">)</span>; <span style="color: #8D8D84;">/*** </span><span style="color: #8D8D84; font-style: italic;">wait for child to exit **</span><span style="color: #8D8D84;">*/</span>                       <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 16 *</span><span style="color: #8D8D84;">*/</span>  
    exit<span style="color: #909183;">(</span>0<span style="color: #909183;">)</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">exit normally </span><span style="color: #8D8D84;">*/</span>                                    <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 17 *</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #7388D6;">}</span>
  <span style="color: #0000FF;">return</span> 0;
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org191fb3f" class="outline-3">
<h3 id="org191fb3f">Second Example &#x2013; Named Pipes</h3>
<div class="outline-text-3" id="text-org191fb3f">
</div><div id="outline-container-org7f1c7b4" class="outline-4">
<h4 id="org7f1c7b4">Overview</h4>
<div class="outline-text-4" id="text-org7f1c7b4">
<p>
A second multiprocessing example in C: key points of the 'named pipe' example
</p>

<ul class="org-ul">
<li>Two separate processes, but no parent/child relationship between them.
<ul class="org-ul">
<li>The processes communicate through a 'named pipe' (aka 'FIFO').
<ul class="org-ul">
<li><p>
A named pipe is a mechanism designed to support IPC among processes on the same host.
</p>
<pre class="example">
           +------------+
writer----&gt;| named pipe |&lt;----reader
           +------------+
</pre></li>
</ul></li>
</ul></li>
<li>The system implements an FIFO as a temporary file.</li>
<li>Named pipes are quite similar in functionality to Unix Domain
Sockets, also called 'local sockets'.
<ul class="org-ul">
<li>Network sockets support communcation between processes running on
different hosts, whereas named pipes and local sockets do the same
for processes running on the same host.</li>
</ul></li>
<li><p>
The example consists of two executable programs, fifoWriter and
fifoReader, which can be executed at the command-line as follows:
</p>
<pre class="example">
% ./fifoWriter &amp;    ## for Windows: fifoWriter &amp; (&amp; puts the process in the background) 
% ./fifoReader      ## for Windows: fifoReader

</pre>
<ul class="org-ul">
<li>There are now two processes executing: fifoWriter and fifoReader</li>
<li>The fifoWriter writes randomly generated integers to the FIFO.</li>
<li>The fifoReader reads these integers from the FIFO until end-of-file.</li>
<li>In the C code, the FIFO is 'written' and 'read' as if it were a
regular disk file: the I/O API is the same.</li>
</ul></li>
</ul>
</div>
</div>
