Vorlesung/ParProg-Grundlagen.org
*** using the shell
#+BEGIN_SRC sh
bash-3.2$ ./fifoWriter &
[1] 7316
bash-3.2$ ./fifoReader
60749779
966803328
1202260494
...
[1]+  Done                    ./fifoWriter
bash-3.2$ 
#+END_SRC
*** Source Code =fifoWriter.c=
#+BEGIN_SRC C
#include <fcntl.h> 
#include <stdio.h>
#include <time.h>
#include <stdlib.h>
#include <unistd.h>
#include <sys/stat.h>
#include <sys/types.h>

#define MaxWrites 256  

int main() {
  srand(time(0)); /* seed the random number generator */

  const char* fifoName = "./myPipe1";          
  mkfifo(fifoName, 0666); /* read/write for user/group/others */             /** line 1 **/
  int fd = open(fifoName, O_CREAT | O_WRONLY); /* open blocks on a FIFO */   /** line 2 **/

  int i;
  for (i = 0; i < MaxWrites; i++) { 
    int n = rand();             
    write(fd, &n, sizeof(int));  /* 4 bytes per int */                       /** line 3 **/
  }
  close(fd);         /* close the fifo */                                    /** line 4 **/
  unlink(fifoName);  /* dispose of underlying file */                        /** line 5 **/
  return 0;
}
#+END_SRC
*** Source Code =fifoReader.c=
#+BEGIN_SRC C
#include <fcntl.h> 
#include <stdio.h>
#include <time.h>
#include <stdlib.h>
#include <unistd.h>
#include <sys/stat.h>
#include <sys/types.h>

int main() {
    const char* fifoName = "./myPipe1";
    int num;
    int fd = open(fifoName, O_RDONLY);              /** line 1 **/

    while (read(fd, &num, sizeof(num)) > 0)         /** line 2 **/ 
      printf("%i\n", num);
    close(fd);                                      /** line 3 **/
    unlink(fifoName);                               /** line 4 **/
    return 0;
}
#+END_SRC
** The Nginx Web Server
# chapter 3: nginx.txt
 Multiprocessing in production-grade software: the nginx web server

+ www.nginx.com
  + The web server is written in C.
  + nginx combines multiprocessing and non-blocking I/O as concurrency mechanisms.

+ nginx, like any modern web server that relies on multiprocessing for concurrency,
   is a "pre-forking" server.
  + nginx can be started as a /system service/ (at boot time), and is platform-neutral.

+ =nginx.conf=  ()configuration entries are key/value pairs: no XML!)
  #+begin_example 
user www-data;           ## www-data (name is arbitrary) is owner of workers
worker_processes 4;      ## default number of workers, might be set to processor count
pid /var/run/nginx.pid;  ## file /var/run/nginx.pid stores pid of master process

events {
   worker_connections 1024;  ## Max of 1024 connections per worker 
   ...                       ## (typical browsers open at least two connections to a 
                                site per client session)
    }   
  #+end_example

+ =ps -ef | grep nginx=
  #+begin_example 
Owner     pid   ppid   nginx process type

root      1803     1   master process /usr/sbin/nginx  ## command that started nginx
www-data  1804  1803   worker process
www-data  1805  1803   worker process
www-data  1807  1803   worker process
www-data  1808  1803   worker process
  #+end_example
