Vorlesung/ParProg-Grundlagen.org
** Execing and Forking Options in Multiprocessing
# chapter 3 execOverview.txt
 A second way for one executing program to start another

+ Review of the previously way, introduction of the new way:
  #+begin_example
        fork()
parent---------->child        ## Both parent and child continue to execute...

         exec...()
process1----------->process2  ## process2 replaces process1, which terminates
  #+end_example
+ In systems speak, an /image/ is an executable program. For instance,
  copying the system from one machine to another is called
  /re-imaging/.
  + In the multiprocessing /pipeExample/ code, the image is the
    compiled, executable program named /pipeExample/
+ A new process can be /spawned/ (created) under one of two distinct
  scenarios, which the difference between the fork() function and the
  exec-family of functions illustrates.
  + The exec-family consists of library functions that, under the
    hood, make the same system call.
+ In a successful call to fork(), the new child process executes the
  /same/ image as the parent that spawned it: the forked process is a
  clone. So the standard code idiom is this:
  #+BEGIN_SRC C
pid_t pid = fork();  /* parent executes this */
...                  /* check for success */
if (0 == pid) {      /* 0 returned to the child */
   ...               /* child code */
}
else {               /* parent code: fork returns child's pid to parent */
   ...               /* alternative parent test: if (pid > 0)
}
  #+END_SRC
+ In a successful call to an exec-function, replaces the current process image with
   a new image that's loaded into memory.
  #+BEGIN_SRC c
int flag = execl("/usr/bin/myGame", "myGame", 0);
if (-1 == flag) perror("Couldn't exec...");
/* on success, the 'myGame' program now executes */
  #+END_SRC
  + The new image has its own address space and other features. In
    summary, the old process stops execution and a new one begins
    execution.
  + The new process retains the pid (and ppid) of the one it replaces
    + The user and group properties are likewise unchanged.
*** Using the Shell
#+BEGIN_SRC sh
bash-3.2$ ./fileStatus tmp
File name: tmp

Information about file tmp:

Owner ID:    503
Group ID:    20
Byte size:   68
Last access: Fri Oct  6 11:10:23 2017
File type:   directory
Owner read:  Owner readable
Owner write: Owner writable

bash-3.2$ ./fileStatus fileStatus
File name: fileStatus

Information about file fileStatus:

Owner ID:    503
Group ID:    20
Byte size:   8808
Last access: Fri Oct  6 11:12:05 2017
File type:   regular
Owner read:  Owner readable
Owner write: Owner writable

bash-3.2$ ./execing
File name: tmp

Information about file tmp:

Owner ID:    503
Group ID:    20
Byte size:   68
Last access: Fri Oct  6 11:10:23 2017
File type:   directory
Owner read:  Owner readable
Owner write: Owner writable
#+END_SRC
*** Source Code
#+BEGIN_SRC C
/* To run: 

   -- compile this program (gcc -o execing execing.c) and fileStatus.c 
   --                      (gcc -o fileStatus fileStatus.c)
   -- create a subdirectory named tmp: mkdir tmp
   -- from the command line: ./execing

   This program 'execs' the fileStatus program, which outputs metadata about the tmp dir..
   Here's a depiction:

                   execv
   execing program------->fileStatus program
*/

#include <unistd.h>
#include <stdio.h>
#include <stdlib.h>

int main() {
  char* const args[] = {"./fileStatus", "tmp", 0};  /* fileStatus program, tmp directory */
  int ret = execv("./fileStatus", args);            /* "v" for "vector" */
  if (-1 == ret) {                                  /* check for failure */
    perror("execv(...) error");
    exit(-1);
  }
  else 
    printf("I'm here\n");                           /* never executes */
  return 0;
}
#+END_SRC
