Vorlesung/ParProg-Grundlagen.html
<div id="outline-container-orgbbc1555" class="outline-3">
<h3 id="orgbbc1555">Process Tracking and Management</h3>
<div class="outline-text-3" id="text-orgbbc1555">
<p>
Process tracking and context switching
</p>

<ul class="org-ul">
<li>Each process has a unique ID (pid), a non-negative integer.
<ul class="org-ul">
<li>A process's pid is recorded in the system's process table.</li>
<li>Library functions getpid() and getppid() get the pid and the
parent's pid, respectively.</li>
<li>The pid of 0 is typically reserved for the 'idle process', the one
that 'runs' when there's nothing else to run.</li>
<li>The 'init process' has a pid of 1: the first user-space process
that the OS kernel spawns in the boot-up.
<ul class="org-ul">
<li>On shutdown, the init process is the last process to terminate:
it waits for all of its children.</li>
<li>The init process starts other processes: system services such as
the login service, etc.</li>
</ul></li>
</ul></li>
<li>Key data structures in a process 'context':
<ul class="org-ul">
<li>process table: tracks information per process, in particular
information that allows a pre-empted process to restart later.</li>
<li>page table(s): translate virtual into physical addresses. Each
process has its own, which effectively partitions virtual address
spaces among processes.</li>
<li>file table: tracks, per process, files that a process has opened.</li>
</ul></li>
<li>Every process has a user and group 'owner', which determines the
process's access rights to resources.
<ul class="org-ul">
<li>Every process likewise belongs to a 'process group', which
facilitates sending signals to every process in a group, to
getting information about related processes, and so on.</li>
<li>In the default case, a child process belongs to the same as its
parent.</li>
</ul></li>
<li>Most modern systems use pre-emptive scheduling, with either
fixed-length or variable-length time-slices: a process that exceeds
the time-slice on a given run is pre-empted and sent back to a
scheduling queue.
<ul class="org-ul">
<li>A process and a thread 'context' consists of key information about
it.
<ul class="org-ul">
<li>For a process, key data structures such as the process table,
the file table, and its page tables define the 'context'.</li>
</ul></li>
</ul></li>
<li>Context switches, which occur during pre-emption, come in two
flavors:
<ul class="org-ul">
<li>From one thread to another within the same process: 'intraprocess
switching'</li>
<li>From one process to another: 'interprocess switching'
<ul class="org-ul">
<li>The big cost is the swapping out of one (virtual) address space
for another: page tables</li>
</ul></li>
<li>A process-level context switch is signficantly more expensive than
a thread-level context switch.
<ul class="org-ul">
<li>The cost of thread-level switching is near zero on modern systems.</li>
<li><p>
Depiction:
</p>
<pre class="example">
Process1      Process2        processor7
  Thread11      Thread21
  Thread12

1st scenario: Thread12 replaces Thread11 on processor7  + virtually no overhead

2nd scenario: Thread21 replaces Thread11 on processor7  + high overhead--
                                                          process context switch
</pre></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3e0ed8a" class="outline-3">
<h3 id="org3e0ed8a">Multiprocessing Through Richer Code Examples</h3>
<div class="outline-text-3" id="text-org3e0ed8a">
<p>
Chapter 4 : 
</p>
<ul class="org-ul">
<li>node.js</li>
<li>ipc</li>
<li>nginx</li>
<li>exercise</li>
<li>upsides and downsides of multiprocessing</li>
</ul>
</div>
<div id="outline-container-org306f49d" class="outline-4">
<h4 id="org306f49d">Overview</h4>
</div>
</div>
</div>
<div id="outline-container-orgc7eb2b9" class="outline-2">
<h2 id="orgc7eb2b9">Multithreading &#x2013; Grundlagen</h2>
<div class="outline-text-2" id="text-orgc7eb2b9">
</div>
<div id="outline-container-org15e5fe9" class="outline-3">
<h3 id="org15e5fe9">Overview</h3>
<div class="outline-text-3" id="text-org15e5fe9">
<p>
Multithreading overview
</p>

<ul class="org-ul">
<li>The chief advantage of multithreading over multiprocessing is that
threads are 'lighter' than processes:
<ul class="org-ul">
<li>A process consists of one or more threads of execution.</li>
<li>A process-level context switch is significantly more expensive, in the millisecond range.</li>
<li>A thread-level context switch has a near-zero cost for threads in
the same process.</li>
</ul></li>
<li>The chief disadvantage is that threads in the same process share the
same address space:
<ul class="org-ul">
<li>The programmer, rather than the OS, must ensure that two threads
in the same process don't inappropriately access the same memory
location (e.g., by trying to update the location).</li>
<li>The programmer must coordinate threads in the same process to
avoid 'race conditions'.  
<ul class="org-ul">
<li>If the coordination is overdone, <i>deadlock</i> may result.</li>
</ul></li>
<li>Thread coordination must be just right:
<ul class="org-ul">
<li>Too little brings the threat of race conditions and, therefore,
unpredictable results.</li>
<li>Too much hurts efficiency and may result in deadlock.</li>
</ul></li>
</ul></li>
<li>Some systems (e.g., Linux) implement threads as processes that
happen to share an address space; other systems (e.g., Windows) have
distinct kernel-level support for threads.
<ul class="org-ul">
<li>Under any implementation, the standard behavior is that distinct
processes have distinct address spaces, whereas threads in the
same process share an address space.</li>
</ul></li>
<li>Examples in C, Java, and Go
<ul class="org-ul">
<li>C# and Java have very similar support for threading, although both
sides might disagree with this characterization. :)</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org7ac13e0" class="outline-4">
<h4 id="org7ac13e0">A Sample Race Condition in Java</h4>
