Vorlesung/ParProg-Grundlagen.html
<div class="outline-text-4" id="text-org7ac13e0">
</div><div id="outline-container-org17aa326" class="outline-5">
<h5 id="org17aa326">source code</h5>
<div class="outline-text-5" id="text-org17aa326">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #036A07;">/** To compile: javac RaceC.java</span>
<span style="color: #036A07;">    To run:     java Main</span>

<span style="color: #036A07;">    Flow of control for Threads referenced by t1 and t2 (for convenience,</span>
<span style="color: #036A07;">    call the Threads referenced by t1 and t2 simply 't1' and 't2'):</span>

<span style="color: #036A07;">    The 'main thread' is the thread that executes the method 'main', in</span>
<span style="color: #036A07;">    this case in class Main (see below).</span>

<span style="color: #036A07;">                 creates</span>
<span style="color: #036A07;">    main thread-----------</span><span style="color: #ff0000; font-weight: bold;">&gt;</span><span style="color: #036A07;">t1 and t2</span>

<span style="color: #036A07;">                  starts</span>
<span style="color: #036A07;">    main thread-----------</span><span style="color: #ff0000; font-weight: bold;">&gt;</span><span style="color: #036A07;">t1 and t2</span>

<span style="color: #036A07;">                 calls run()</span>
<span style="color: #036A07;">    Java runtime-------------</span><span style="color: #ff0000; font-weight: bold;">&gt;</span><span style="color: #036A07;">on started Threads t1 and t2</span>

<span style="color: #036A07;">    At this point, three threads in the app are executing: main, t1, and t2.</span>

<span style="color: #036A07;">    An instance of a Java Thread represents the sequence of instructions in the</span>
<span style="color: #036A07;">    body of the encapsulated 'run' method (and any other instructions in methods</span>
<span style="color: #036A07;">    that 'run' invokes).</span>

<span style="color: #036A07;">    A thread that exits run() terminates, and cannot be restarted.</span>
<span style="color: #036A07;">*/</span>
<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">RaceC</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">n</span>;                            <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">a single instance on n</span>
    <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">race</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        n = 0;                               <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">initialize to zero before threads alter its value</span>
        <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">limit</span> = <span style="color: #D0372D;">Integer</span>.MAX_VALUE * 2L; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">four billion and change</span>
        <span style="color: #6434A3;">Thread</span> <span style="color: #BA36A5;">t1</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Thread</span><span style="color: #909183;">()</span> <span style="color: #909183;">{</span>           <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">incrementing thread</span>
                <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #709870;">()</span> <span style="color: #709870;">{</span> 
                    <span style="color: #0000FF;">for</span> <span style="color: #907373;">(</span><span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #6434A3;">limit</span>; i++<span style="color: #907373;">)</span> n = n + 1; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">increment limit times</span>
                <span style="color: #709870;">}</span>
            <span style="color: #909183;">}</span>;
        <span style="color: #6434A3;">Thread</span> <span style="color: #BA36A5;">t2</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Thread</span><span style="color: #909183;">()</span> <span style="color: #909183;">{</span>           <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">decrementing thread</span>
                <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #709870;">()</span> <span style="color: #709870;">{</span>
                    <span style="color: #0000FF;">for</span> <span style="color: #907373;">(</span><span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #6434A3;">limit</span>; i++<span style="color: #907373;">)</span> n = n - 1; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">decrement limit times</span>
                <span style="color: #709870;">}</span>
            <span style="color: #909183;">}</span>;
        t1.start<span style="color: #909183;">()</span>;  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">start t1's execution</span>
        t2.start<span style="color: #909183;">()</span>;  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">start t2's execution</span>
        <span style="color: #0000FF;">try</span> <span style="color: #909183;">{</span>
            t1.join<span style="color: #709870;">()</span>;  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">wait here until t1 terminates</span>
            t2.join<span style="color: #709870;">()</span>;  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">wait here until t2 terminates</span>
        <span style="color: #909183;">}</span> <span style="color: #0000FF;">catch</span><span style="color: #909183;">(</span><span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span> <span style="color: #909183;">}</span>
        System.out.println<span style="color: #909183;">(</span><span style="color: #008000;">"n's value is: "</span> + n<span style="color: #909183;">)</span>;
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Main</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span><span style="color: #909183;">[</span> <span style="color: #909183;">]</span> <span style="color: #BA36A5;">args</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>         <span style="color: #8D8D84;">//</span><span style="color: #8D8D84; font-style: italic;">*** main thread executes method main</span>
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; 8; i++<span style="color: #909183;">)</span> RaceC.race<span style="color: #909183;">()</span>; 
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>
<span style="color: #036A07;">/** Output from a sample run:</span>

<span style="color: #036A07;">    n's value is: -265936</span>
<span style="color: #036A07;">    n's value is: -7317</span>
<span style="color: #036A07;">    n's value is: 47128</span>
<span style="color: #036A07;">    n's value is: -219153</span>
<span style="color: #036A07;">    n's value is: 82805</span>
<span style="color: #036A07;">    n's value is: -7944</span>
<span style="color: #036A07;">    n's value is: 87322</span>
<span style="color: #036A07;">    n's value is: -2</span>
<span style="color: #036A07;">*/</span></pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb50dbe5" class="outline-5">
<h5 id="orgb50dbe5">using the shell</h5>
<div class="outline-text-5" id="text-orgb50dbe5">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ javac RaceC.java
bash-3.2$ java Main
n<span style="color: #008000;">'s value is: -332920</span>
<span style="color: #008000;">n'</span>s value is: 237836
n<span style="color: #008000;">'s value is: 73816</span>
<span style="color: #008000;">n'</span>s value is: 61941
n<span style="color: #008000;">'s value is: 59569</span>
<span style="color: #008000;">n'</span>s value is: -2
n<span style="color: #008000;">'s value is: -2</span>
<span style="color: #008000;">n'</span>s value is: 80561</pre>
</pre>
</div>
</div>
</div>
</div>
