Vorlesung/ParProg-Grundlagen.org
**** source code
#+BEGIN_SRC java
/** To compile and run from the command-line:
      javac Deadlock.java
      java Deadlock
*/
public class Deadlock {
    static Object lock1 = new Object(); // a single lock1                   /** line 1 **/
    static Object lock2 = new Object(); // a single lock2
    
    /** Each thread executes its run() method. **/
    public static void main(String args[]) {
	Thread thread1 = new Thread() {
		public void run() {                            
		    synchronized(lock1) {                                   /** line 2 **/
			print("thread1 holds lock1");
			try { Thread.sleep(2); } catch(Exception e) { }     /** line 3 **/
			print("thread1 waiting for lock2");
			print("\t(thread1 needs lock2 to release lock1...)");
			synchronized(lock2) {                               /** line 4 **/
			    print("thread1 holds lock1 and lock2");
			} // lock2 released here                            /** line 5 **/
		    } // lock1 released here                                /** line 6 **/
		} 
	    };
	Thread thread2 = new Thread() {
		public void run() {
		    synchronized(lock2) {                                   /** line 7 **/
			print("thread2 holds lock2");
			try { Thread.sleep(2); } catch(Exception e) { }
			print("thread2 waiting for lock1");
			print("\t(thread2 needs lock1 to release lock2...)");
			synchronized(lock1) {                               /** line 8 **/
			    print("thread2 holds lock2 and lock1");
			} // lock1 released here                            /** line 9 **/
		    } // lock2 released here                                /** line 10 **/
		}
	    };
	thread1.start();                                                    /** line 11 **/
	thread2.start();                                                    /** line 12 **/
    }
    private static void print(Object obj) { System.out.println(obj); }
}
#+END_SRC

*** High-level Concurrency Management in Multithreading
# chapter 5: highlevelcm.txt
+ Belaboring the obvious: multithreading is far trickier to manage than multiprocessing
  + The OS keeps the processes in multiprocessing from stepping on one another's storge.
  + The programmer must do the same for threads within a process: thread coordination
+ How to support to thread-safety (i.e., safety from race conditions)?
  + Consider an in-memory mutable list and an /add/ operation.
  #+begin_example
       ADD 3  +---+---+
thread------->| 1 | 2 |        ## list L before the ADD
              +---+---+
              +---+---+---+
              | 1 | 2 | 3 |    ## list L after the ADD, which changes the original list
              +---+---+---+
  #+end_example
+ Basic Java approach: Ensure mutual exclusion on shared storage through locking.
  + Locking allows only single-threaded access to the list L during an ADD operation.

+ Basic Clojure approach: make in-memory objects immutable by default, with a few exceptions
  + The ADD operation first makes a copy of the original list, and then changes the copy.
  #+begin_example
       ADD 3  +---+---+
thread------->| 1 | 2 |        ## list L 
              +---+---+
                  L

              +---+---+
              | 1 | 2 |        ## copy of list L
              +---+---+
                  Lc

              +---+---+---+
              | 1 | 2 | 3 |    ## copy after the ADD (original is unchanged)
              +---+---+---+
                  Lc
  #+end_example
+ The preferred Go approach: have a single thread control access to
  list L, with other threads sending messages such as ADD to this
  controlling thread.
  + The messages are sent through a thread-safe channel.
  #+begin_example
             +---+---+
             | 1 | 2 |      ## a single thread T controls access to L
             +---+---+

        ADD 3                ADD 33
thread1------->channel to T<--------thread2  ## the channel has built-in synchronization
  #+end_example
*** Wrapup of multithreading basics and miscellany
# chapter 5: wrapup5.txt
