Vorlesung/ParProg-Grundlagen.org
**** Wrapup

+ Multithreading can be a highly efficient way to do concurrent
  programming, as thread-level context switches are very cheap.
  + It's the preferred approach to concurrency in languages such as
    Java and C#.
+ Multithreading has twin challenges for the programmer:
  + Avoid race conditions by ensuring that multiple threads don't
    access shared memory locations in inappropriate ways.
    + Ensure that critical sections are executed in single-threaded
      mode.
  + Avoid /over synchronization/ that degrades performance and may
    result in deadlock.
+ Languages now offer programmers high-level constructs and types to
  ease the challenges of multithreaded programming.
  + But sometimes a simple mutex is still the way to go.
 
**** Native versus green threads, and the Global Interpreter Lock (GIL)

+ A /native thread/ is under kernel OS control when it comes to
  scheduling.
  + Since roughly 2000, Java Thread instances map to /native/
    threads. (Same for C#.)
  + C's /pthreads/ (the 'p' for POSIX API standardization) are
    /native/ threads.
+ A /green thread/ (aka /microthread/, /tasklet/) is under a particular language's runtime control.
  + In effect, /green threads/ emulate native threads, and may provide
    better performance for operations such as thread creation and
    synchronization.
  + Prior to version 1.9, for example, Ruby's standard implementation (CRuby) had only green threads.
+ A GIL is a mechanism (in implementation, a mutex) that a runtime
  uses to allow only one thread to execute at a time, even in a
  multithreaded environment: no thread-level parallelism.
  + The standard implementations of Ruby (CRuby) and Python (CPython) have a GIL.

*** Exercise for basic multithreading
# chapter 5: exerciseMT.txt

+ Fix the RaceC program (RaceC.java) by providing explicit locking.
  + Use synchronized blocks and a shared lock to ensure that threads
    t1 and t2 do the increment and decrement operations /atomically/
    (that is, without interruption).
  + *Hint:* use a static field as the lock to ensure there's a single instance of the lock.
+ To get a sense of what thread syncrhonization costs, time the RaceC
  program with and without thread synchronization.
  + The program's execution can be timed in various ways, including the way sketched below:
  #+BEGIN_SRC java
final long startTime = System.currentTimeMillis();
/*** code to be timed ***/
final long stopTime = System.currentTimeMillis();
final long latency = stopTime - startTime;
  #+END_SRC

** Multithreading Through Richer Code Examples 
# ev. überspringen / Studi-Thema
Chapter 6
** Thread-Safety And High-Level Concurrent Types In Java
Chapter 7 
# ev. Studi-Thema
** Options For Thread Synchronization And Cooperation
Chapter 8
# ???
** Concurrency And Non-Blocking I-O
Chapter 9
# ev. überspringen

* Parallele Algorithmen
# Titel fraglich
** Parallelism Basics
# Chapter 10
*** Overview of Parallelism Beyond Concurrency
# Chapter 10 parallelismOverview.txt
 Parallelism in computing

+ So far the emphasis has been on parallelism as concurrency made
  efficient: multiple concurrent tasks are distributed among
  processors so that the tasks can be processed literally at the same
  time--in parallel.
+ In a multiprocessing approach to concurrency, multiple processes
  execute on multiple processors.
  + The OS handles the scheduling.
+ In a multithreading approach to concurrency, multiple threads within a process execute on multiple processors.
  + If API threads map to /native/ threads, then the OS handles the scheduling. (Assuming no GIL.)
+ In hybrid approaches (e.g., Asp.Net's multithreaded worker
  processes), there's still the distribution of task processing among
  multiple processors.

The goal now is to focus on broader uses of parallel computation.

+ Some reasons why parallelism is now so attractive:
  + Consumer desktop, laptop, and even handheld machines are now
    multi-core, with one or more processors per core.
    + In fact (even if not in reputation), these machines are /parallel computers/.
    + At issue is how to exploit this possibily for parallel computations.
  + Consumer-level machines may come with GPUs (graphics-processing
    units) and FPUs (floating-point unit or /math coproccessor/) as
    well as CPUs (central or /generic/ processing units).
    + GPUs and FPUs are designed for parallelism.
    + /gpgpu/ (general-purpose computing on a GPU) refers to the use
      of a GPU for /general purposes/, that is, purposes beyond just
      graphics. So gpgpu approaches a GPU as if it were a
      (specialized) CPU.
  + Distributed software systems such as email and the WWW have code
    modules that execute on physically distinct devices.
    + The /network as the computer/ describes networked hosts, each
      with its own collection of processors, as a resource for
      distributed parallel computation.
    + The key challenge is how to coordinate such computations and to share information among them.
      + Message-passing is a popular, general method.
+ Parallel computations may used shared, centralized memory;
  distributed memory; or some hybrid of the two.
  + The point of interest is how to write programs that execute as
    parallel computations.
  + Support from toolchains (in particular, compilers therein) is
    critical to encouarge widespread use of hardware support for
    parallel computing.

*** A SIMD Auto Vectorization Code Example in C
