Vorlesung/ParProg-Grundlagen.html
<div id="outline-container-orgdb87008" class="outline-5">
<h5 id="orgdb87008">Wrapup</h5>
<div class="outline-text-5" id="text-orgdb87008">
<ul class="org-ul">
<li>Multithreading can be a highly efficient way to do concurrent
programming, as thread-level context switches are very cheap.
<ul class="org-ul">
<li>It's the preferred approach to concurrency in languages such as
Java and C#.</li>
</ul></li>
<li>Multithreading has twin challenges for the programmer:
<ul class="org-ul">
<li>Avoid race conditions by ensuring that multiple threads don't
access shared memory locations in inappropriate ways.
<ul class="org-ul">
<li>Ensure that critical sections are executed in single-threaded
mode.</li>
</ul></li>
<li>Avoid 'over synchronization' that degrades performance and may
result in deadlock.</li>
</ul></li>
<li>Languages now offer programmers high-level constructs and types to
ease the challenges of multithreaded programming.
<ul class="org-ul">
<li>But sometimes a simple mutex is still the way to go.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgbc56342" class="outline-5">
<h5 id="orgbc56342">Native versus green threads, and the Global Interpreter Lock (GIL)</h5>
<div class="outline-text-5" id="text-orgbc56342">
<ul class="org-ul">
<li>A 'native thread' is under kernel OS control when it comes to
scheduling.
<ul class="org-ul">
<li>Since roughly 2000, Java Thread instances map to 'native'
threads. (Same for C#.)</li>
<li>C's 'pthreads' (the 'p' for POSIX API standardization) are
'native' threads.</li>
</ul></li>
<li>A 'green thread' (aka 'microthread', 'tasklet') is under a particular language's runtime control.
<ul class="org-ul">
<li>In effect, 'green threads' emulate native threads, and may provide
better performance for operations such as thread creation and
synchronization.</li>
<li>Prior to version 1.9, for example, Ruby's standard implementation (CRuby) had only green threads.</li>
</ul></li>
<li>A GIL is a mechanism (in implementation, a mutex) that a runtime
uses to allow only one thread to execute at a time, even in a
multithreaded environment: no thread-level parallelism.
<ul class="org-ul">
<li>The standard implementations of Ruby (CRuby) and Python (CPython) have a GIL.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbe9f3e7" class="outline-4">
<h4 id="orgbe9f3e7">Exercise for basic multithreading</h4>
<div class="outline-text-4" id="text-orgbe9f3e7">
<ul class="org-ul">
<li>Fix the RaceC program (RaceC.java) by providing explicit locking.
<ul class="org-ul">
<li>Use synchronized blocks and a shared lock to ensure that threads
t1 and t2 do the increment and decrement operations 'atomically'
(that is, without interruption).'</li>
<li><b>Hint:</b> use a static field as the lock to ensure there's a single instance of the lock.</li>
</ul></li>
<li><p>
To get a sense of what thread syncrhonization costs, time the RaceC
program with and without thread synchronization.
</p>
<ul class="org-ul">
<li>The program's execution can be timed in various ways, including the way sketched below:</li>
</ul>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">final</span> <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">startTime</span> = System.currentTimeMillis<span style="color: #707183;">()</span>;
<span style="color: #036A07;">/*** code to be timed ***/</span>
<span style="color: #0000FF;">final</span> <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">stopTime</span> = System.currentTimeMillis<span style="color: #707183;">()</span>;
<span style="color: #0000FF;">final</span> <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">latency</span> = stopTime - startTime;</pre>
</pre>
</div></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org489d750" class="outline-3">
<h3 id="org489d750">Multithreading Through Richer Code Examples</h3>
<div class="outline-text-3" id="text-org489d750">
<p>
Chapter 6
</p>
</div>
</div>
<div id="outline-container-org4297020" class="outline-3">
<h3 id="org4297020">Thread-Safety And High-Level Concurrent Types In Java</h3>
<div class="outline-text-3" id="text-org4297020">
<p>
Chapter 7 
</p>
</div>
</div>
<div id="outline-container-org6012d96" class="outline-3">
<h3 id="org6012d96">Options For Thread Synchronization And Cooperation</h3>
<div class="outline-text-3" id="text-org6012d96">
<p>
Chapter 8
</p>
</div>
</div>
<div id="outline-container-orgef1f8e5" class="outline-3">
<h3 id="orgef1f8e5">Concurrency And Non-Blocking I-O</h3>
<div class="outline-text-3" id="text-orgef1f8e5">
<p>
Chapter 9
</p>
</div>
</div>
</div>

<div id="outline-container-orgfe08862" class="outline-2">
<h2 id="orgfe08862">Parallele Algorithmen</h2>
<div class="outline-text-2" id="text-orgfe08862">
</div>
<div id="outline-container-org2bbca4d" class="outline-3">
<h3 id="org2bbca4d">Parallelism Basics</h3>
<div class="outline-text-3" id="text-org2bbca4d">
</div>
<div id="outline-container-org0fc4f94" class="outline-4">
<h4 id="org0fc4f94">Overview of Parallelism Beyond Concurrency</h4>
<div class="outline-text-4" id="text-org0fc4f94">
<p>
Parallelism in computing
</p>

<ul class="org-ul">
<li>So far the emphasis has been on parallelism as concurrency made
efficient: multiple concurrent tasks are distributed among
processors so that the tasks can be processed literally at the same
time&#x2013;in parallel.</li>
<li>In a multiprocessing approach to concurrency, multiple processes
execute on multiple processors.
<ul class="org-ul">
<li>The OS handles the scheduling.</li>
</ul></li>
<li>In a multithreading approach to concurrency, multiple threads within a process execute on multiple processors.
<ul class="org-ul">
<li>If API threads map to 'native' threads, then the OS handles the scheduling. (Assuming no GIL.)</li>
</ul></li>
<li>In hybrid approaches (e.g., Asp.Net's multithreaded worker
processes), there's still the distribution of task processing among
multiple processors.</li>
</ul>

<p>
The goal now is to focus on broader uses of parallel computation.
</p>

<ul class="org-ul">
<li>Some reasons why parallelism is now so attractive:
<ul class="org-ul">
<li>Consumer desktop, laptop, and even handheld machines are now
multi-core, with one or more processors per core.
<ul class="org-ul">
<li>In fact (even if not in reputation), these machines are 'parallel computers'.</li>
<li>At issue is how to exploit this possibily for parallel computations.</li>
</ul></li>
<li>Consumer-level machines may come with GPUs (graphics-processing
units) and FPUs (floating-point unit or 'math coproccessor') as
well as CPUs (central or 'generic' processing units).
<ul class="org-ul">
<li>GPUs and FPUs are designed for parallelism.</li>
<li>'gpgpu' (general-purpose computing on a GPU) refers to the use
of a GPU for 'general purposes', that is, purposes beyond just
graphics. So gpgpu approaches a GPU as if it were a
(specialized) CPU.</li>
</ul></li>
<li>Distributed software systems such as email and the WWW have code
modules that execute on physically distinct devices.
<ul class="org-ul">
<li>The 'network as the computer' describes networked hosts, each
with its own collection of processors, as a resource for
distributed parallel computation.</li>
<li>The key challenge is how to coordinate such computations and to share information among them.
<ul class="org-ul">
<li>Message-passing is a popular, general method.</li>
</ul></li>
</ul></li>
</ul></li>
<li>Parallel computations may used shared, centralized memory;
distributed memory; or some hybrid of the two.
<ul class="org-ul">
<li>The point of interest is how to write programs that execute as
parallel computations.</li>
<li>Support from toolchains (in particular, compilers therein) is
critical to encouarge widespread use of hardware support for
parallel computing.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9bb45b6" class="outline-4">
<h4 id="org9bb45b6">A SIMD Auto Vectorization Code Example in C</h4>
