Vorlesung/ParProg-Grundlagen.org
**** the non parallel version
#+BEGIN_SRC C
/** To compile and run:

    gcc -o nonsimd nonsimd.c
    ./nonsimd  # On Windows: simd
,*/
  
#include <stdio.h>

#define Length 8

int main() {
  int array1[ ] = {1, 2, 3, 4, 5, 6, 7, 8}; 
  int array2[ ] = {8, 7, 6, 5, 4, 3, 2, 1};
  int sum[Length];

  int i;
  for (i = 0; i < Length; i++) sum[i] = array1[i] + array2[i]; /** serial computation **/
  
  for (i = 0; i < Length; i++) printf("%i ", sum[i]); 
  putchar('\n');
  return 0;
}
/** A better way: SSE = Streaming SIMD Extensions = additional instruction set, 
    more CPU registers

In the late 1990s, Intel introduced an SSE instruction set for their Pentium III
processors. This became known as the MMX instruction set. (Officially, MMX is not an
acronym.) AMD earlier introduced a comparable instruction set known as 3DNow!. In any case, 
the hardware support included new registers with names that start with 'xmm'. In the 
original SSE, there was support only for integer operations.

SEE has progressed, with new versions: SSE2, SSE3, SSSE3, and
SSE4. The newer versions bring SIMD support for both integer and
floating-point operations. At the same time, C/C++ compilers such as
GNU and Clang provided support, eventually automatic, for
SIMD-friendly code. Nowadays, both compilers are capable of 'automatic
vectorization' of approrpiately written source code.

The short version: elements in the arrays 'array1' and 'array2' should
be added pairwise in parallel in order to boost performance.
,*/
#+END_SRC
**** the parallel version
#+BEGIN_SRC C
/** To compile and run:

    gcc -o simd simd.c
    ./simd  # On Windows: simd

 No explicit optimization is required. The GNU and Clang compilers
 do the optimization automatically. 
*/
  
#include <stdio.h>

/* A typedef in C supports 'aliasing' of data types. Here's a simple example:

     typedef unsigned boolean; ## 'unsigned' is short for 'unsigned int'

   This typedef allows 'boolean' to be used in place of 'unsigned', for example:

     boolean flag = 0;  ## 0 is 'false' in C

   The typedef below is more complicated, as it includes special information for the
   compiler, in particuar the '__attribute__' and 'vector_size' terms. Here's the upshot
   of the typedef:

   # 'intV8' aliases 'int', but as a vector (1-dimensional array) rather than as a scalar 
      type.
   # The size of an 'intV8' vector is set to 32 == Length * sizeof(int) == 8 * 4. 
     The size is in bytes.
*/
#define Length 8
typedef int intV8 __attribute__ ((vector_size (Length * sizeof(int)))); /** 32 bytes **/
    
int main() {
  intV8 dataV1 = {1, 2, 3, 4, 5, 6, 7, 8}; /* initialize vector dataV1: no array syntax */                   
  intV8 dataV2 = {8, 7, 6, 5, 4, 3, 2, 1}; /* same for vector dataV2 */
  
  intV8 add = dataV1 + dataV2; /* 9  9  9  9  9  9  9 9 -- no array syntax */
  intV8 mul = dataV1 * dataV2; /* 8 14 18 20 20 18 14 8 -- no array syntax */
  intV8 div = dataV2 / dataV1; /* 8  3  2  1  0  0  0 0 -- no array syntax */
  int i;
  for (i = 0; i < Length; i++) printf("%i ", add[i]); /* array syntax */
  putchar('\n');
  return 0;
}
#+END_SRC
*** using the shell
#+BEGIN_SRC sh 
bash-3.2$ gcc -o nonsimd nonsimd.c
bash-3.2$ gcc -o simd simd.c

bash-3.2$ ./nonsimd
9 9 9 9 9 9 9 9 

bash-3.2$ ./simd
9 9 9 9 9 9 9 9 
#+END_SRC
