Vorlesung/ParProg-Grundlagen.html
<div class="outline-text-4" id="text-org9bb45b6">
</div><div id="outline-container-org0095232" class="outline-5">
<h5 id="org0095232">the non parallel version</h5>
<div class="outline-text-5" id="text-org0095232">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">To compile and run:</span>

<span style="color: #8D8D84; font-style: italic;">    gcc -o nonsimd nonsimd.c</span>
<span style="color: #8D8D84; font-style: italic;">    ./nonsimd  # On Windows: simd</span>
<span style="color: #8D8D84;">*/</span>
  
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdio.h</span><span style="color: #707183;">&gt;</span>

<span style="color: #808080;">#define</span> <span style="color: #BA36A5;">Length</span> 8

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">array1</span><span style="color: #7388D6;">[</span> <span style="color: #7388D6;">]</span> = <span style="color: #7388D6;">{</span>1, 2, 3, 4, 5, 6, 7, 8<span style="color: #7388D6;">}</span>; 
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">array2</span><span style="color: #7388D6;">[</span> <span style="color: #7388D6;">]</span> = <span style="color: #7388D6;">{</span>8, 7, 6, 5, 4, 3, 2, 1<span style="color: #7388D6;">}</span>;
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">sum</span><span style="color: #7388D6;">[</span>Length<span style="color: #7388D6;">]</span>;

  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span>;
  <span style="color: #0000FF;">for</span> <span style="color: #7388D6;">(</span>i = 0; i &lt; Length; i++<span style="color: #7388D6;">)</span> sum<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span> = array1<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span> + array2<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span>; <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">serial computation *</span><span style="color: #8D8D84;">*/</span>
  
  <span style="color: #0000FF;">for</span> <span style="color: #7388D6;">(</span>i = 0; i &lt; Length; i++<span style="color: #7388D6;">)</span> printf<span style="color: #7388D6;">(</span><span style="color: #008000;">"%i "</span>, sum<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span>; 
  putchar<span style="color: #7388D6;">(</span><span style="color: #008000;">'\n'</span><span style="color: #7388D6;">)</span>;
  <span style="color: #0000FF;">return</span> 0;
<span style="color: #707183;">}</span>
<span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">A better way: SSE = Streaming SIMD Extensions = additional instruction set, </span>
<span style="color: #8D8D84; font-style: italic;">    more CPU registers</span>

<span style="color: #8D8D84; font-style: italic;">In the late 1990s, Intel introduced an SSE instruction set for their Pentium III</span>
<span style="color: #8D8D84; font-style: italic;">processors. This became known as the MMX instruction set. (Officially, MMX is not an</span>
<span style="color: #8D8D84; font-style: italic;">acronym.) AMD earlier introduced a comparable instruction set known as 3DNow!. In any case, </span>
<span style="color: #8D8D84; font-style: italic;">the hardware support included new registers with names that start with 'xmm'. In the </span>
<span style="color: #8D8D84; font-style: italic;">original SSE, there was support only for integer operations.</span>

<span style="color: #8D8D84; font-style: italic;">SEE has progressed, with new versions: SSE2, SSE3, SSSE3, and</span>
<span style="color: #8D8D84; font-style: italic;">SSE4. The newer versions bring SIMD support for both integer and</span>
<span style="color: #8D8D84; font-style: italic;">floating-point operations. At the same time, C/C++ compilers such as</span>
<span style="color: #8D8D84; font-style: italic;">GNU and Clang provided support, eventually automatic, for</span>
<span style="color: #8D8D84; font-style: italic;">SIMD-friendly code. Nowadays, both compilers are capable of 'automatic</span>
<span style="color: #8D8D84; font-style: italic;">vectorization' of approrpiately written source code.</span>

<span style="color: #8D8D84; font-style: italic;">The short version: elements in the arrays 'array1' and 'array2' should</span>
<span style="color: #8D8D84; font-style: italic;">be added pairwise in parallel in order to boost performance.</span>
<span style="color: #8D8D84;">*/</span></pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf614685" class="outline-5">
<h5 id="orgf614685">the parallel version</h5>
<div class="outline-text-5" id="text-orgf614685">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">To compile and run:</span>

<span style="color: #8D8D84; font-style: italic;">    gcc -o simd simd.c</span>
<span style="color: #8D8D84; font-style: italic;">    ./simd  # On Windows: simd</span>

<span style="color: #8D8D84; font-style: italic;"> No explicit optimization is required. The GNU and Clang compilers</span>
<span style="color: #8D8D84; font-style: italic;"> do the optimization automatically. </span>
<span style="color: #8D8D84;">*/</span>
  
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdio.h</span><span style="color: #707183;">&gt;</span>

<span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">A typedef in C supports 'aliasing' of data types. Here's a simple example:</span>

<span style="color: #8D8D84; font-style: italic;">     typedef unsigned boolean; ## 'unsigned' is short for 'unsigned int'</span>

<span style="color: #8D8D84; font-style: italic;">   This typedef allows 'boolean' to be used in place of 'unsigned', for example:</span>

<span style="color: #8D8D84; font-style: italic;">     boolean flag = 0;  ## 0 is 'false' in C</span>

<span style="color: #8D8D84; font-style: italic;">   The typedef below is more complicated, as it includes special information for the</span>
<span style="color: #8D8D84; font-style: italic;">   compiler, in particuar the '__attribute__' and 'vector_size' terms. Here's the upshot</span>
<span style="color: #8D8D84; font-style: italic;">   of the typedef:</span>

<span style="color: #8D8D84; font-style: italic;">   # 'intV8' aliases 'int', but as a vector (1-dimensional array) rather than as a scalar </span>
<span style="color: #8D8D84; font-style: italic;">      type.</span>
<span style="color: #8D8D84; font-style: italic;">   # The size of an 'intV8' vector is set to 32 == Length * sizeof(int) == 8 * 4. </span>
<span style="color: #8D8D84; font-style: italic;">     The size is in bytes.</span>
<span style="color: #8D8D84;">*/</span>
<span style="color: #808080;">#define</span> <span style="color: #BA36A5;">Length</span> 8
<span style="color: #0000FF;">typedef</span> <span style="color: #6434A3;">int</span> <span style="color: #6434A3;">intV8</span> <span style="color: #0000FF;">__attribute__</span> <span style="color: #707183;">(</span><span style="color: #7388D6;">(</span>vector_size <span style="color: #909183;">(</span><span style="color: #6434A3;">Length</span> * <span style="color: #0000FF;">sizeof</span><span style="color: #709870;">(</span><span style="color: #6434A3;">int</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>; <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">32 bytes *</span><span style="color: #8D8D84;">*/</span>
    
<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
  <span style="color: #6434A3;">intV8</span> <span style="color: #BA36A5;">dataV1</span> = <span style="color: #7388D6;">{</span>1, 2, 3, 4, 5, 6, 7, 8<span style="color: #7388D6;">}</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">initialize vector dataV1: no array syntax </span><span style="color: #8D8D84;">*/</span>                   
  <span style="color: #6434A3;">intV8</span> <span style="color: #BA36A5;">dataV2</span> = <span style="color: #7388D6;">{</span>8, 7, 6, 5, 4, 3, 2, 1<span style="color: #7388D6;">}</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">same for vector dataV2 </span><span style="color: #8D8D84;">*/</span>
  
  <span style="color: #6434A3;">intV8</span> <span style="color: #BA36A5;">add</span> = dataV1 + dataV2; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">9  9  9  9  9  9  9 9 -- no array syntax </span><span style="color: #8D8D84;">*/</span>
  <span style="color: #6434A3;">intV8</span> <span style="color: #BA36A5;">mul</span> = dataV1 * dataV2; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">8 14 18 20 20 18 14 8 -- no array syntax </span><span style="color: #8D8D84;">*/</span>
  <span style="color: #6434A3;">intV8</span> <span style="color: #BA36A5;">div</span> = dataV2 / dataV1; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">8  3  2  1  0  0  0 0 -- no array syntax </span><span style="color: #8D8D84;">*/</span>
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span>;
  <span style="color: #0000FF;">for</span> <span style="color: #7388D6;">(</span>i = 0; i &lt; Length; i++<span style="color: #7388D6;">)</span> printf<span style="color: #7388D6;">(</span><span style="color: #008000;">"%i "</span>, add<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">array syntax </span><span style="color: #8D8D84;">*/</span>
  putchar<span style="color: #7388D6;">(</span><span style="color: #008000;">'\n'</span><span style="color: #7388D6;">)</span>;
  <span style="color: #0000FF;">return</span> 0;
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5820cb3" class="outline-4">
<h4 id="org5820cb3">using the shell</h4>
<div class="outline-text-4" id="text-org5820cb3">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ gcc -o nonsimd nonsimd.c
bash-3.2$ gcc -o simd simd.c

bash-3.2$ ./nonsimd
9 9 9 9 9 9 9 9 

bash-3.2$ ./simd
9 9 9 9 9 9 9 9 </pre>
</pre>
</div>
</div>
</div>
