Vorlesung/ParProg-Grundlagen.html
<div id="outline-container-orgd4eb585" class="outline-4">
<h4 id="orgd4eb585">using the shell</h4>
<div class="outline-text-4" id="text-orgd4eb585">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ gcc -o sseTimings sseTimings.c
bash-3.2$ ./sseTimings
<span style="color: #006699;">in_serial</span><span style="color: #707183;">()</span>  : 19905
<span style="color: #006699;">in_parallel</span><span style="color: #707183;">()</span>: 10483
bash-3.2$ ./sseTimings
<span style="color: #006699;">in_serial</span><span style="color: #707183;">()</span>  : 22260
<span style="color: #006699;">in_parallel</span><span style="color: #707183;">()</span>: 11319
bash-3.2$ ./sseTimings
<span style="color: #006699;">in_serial</span><span style="color: #707183;">()</span>  : 21785
<span style="color: #006699;">in_parallel</span><span style="color: #707183;">()</span>: 10957</pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgec0c38f" class="outline-3">
<h3 id="orgec0c38f">OpenMp</h3>
<div class="outline-text-3" id="text-orgec0c38f">
</div>
<div id="outline-container-org934c3d1" class="outline-4">
<h4 id="org934c3d1">Overview</h4>
</div>
<div id="outline-container-orgb0db8de" class="outline-4">
<h4 id="orgb0db8de">Basics</h4>
</div>
<div id="outline-container-org70391ed" class="outline-4">
<h4 id="org70391ed">Miser-Spendthrift Problem</h4>
</div>
</div>
<div id="outline-container-org9196d5c" class="outline-3">
<h3 id="org9196d5c">Parallelism and Performance</h3>
<div class="outline-text-3" id="text-org9196d5c">
</div>
<div id="outline-container-org6c8dcc2" class="outline-4">
<h4 id="org6c8dcc2">How Can Performance Gains Through Parallelism Be Measured</h4>
<div class="outline-text-4" id="text-org6c8dcc2">
<p>
Parallelism and performance
</p>

<ul class="org-ul">
<li>Revised 'sseTimings' program, now in 3 versions: 'timings2048',
'timings8192', and 'timings32768':
<ul class="org-ul">
<li>Average speedup of 'serial' version from 20 test runs:<br />
'timings2048':  average speedup of 2.17    ## 2048 is vector size<br />
'timings8192':  average speedup of 1.72    ##  8192 <code>= 2048 x 4\\
       'timings32768': average speedup of 1.65    ## 32768 =</code> 8192 x 4</li>
<li>Key question: The 'in<sub>parallel</sub>()' function does only 1/4th the
arithmetic operations as the 'in<sub>serial</sub>()' function. Why is max
speedup above only slightly over 2 rather than close to (or even
at) 4?</li>
</ul></li>
</ul>
<hr />
<ul class="org-ul">
<li>How to measure performance?
<ul class="org-ul">
<li>Response time ('latency'): elapsed time
<ul class="org-ul">
<li>Program P1 takes 10 units, whereas program P2 takes 5: P1/P2 =
2, a speedup of 2</li>
</ul></li>
<li>Throughput: number of tasks completed in a fixed amount of time.
<ul class="org-ul">
<li><p>
On single-processor machine M1, with required times for processing above the arrows:
</p>
<pre class="example">
    5       3   +-----------+
T2-----&gt;T1-----&gt;| processor |  ## Two tasks completed in 8 time units on M1
                +-----------+
</pre></li>
<li><p>
On multiple-processor machine M2:
</p>
<pre class="example">
   5   +-----------+
T1-----&gt;| processor | ## T1 takes a bit longer on M2
       +-----------+
               ## Two tasks completed in 5 time units on M2, a speedup of about 1.6
   5   +-----------+
T2-----&gt;| processor | ## T2 takes the same amount of time on M1 and M2
       +-----------+
</pre></li>
</ul></li>
<li>Big picture: parallelism is a good way to boost performance
<ul class="org-ul">
<li>Parallelism tends to increase throughput, and thereby performance.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
