Vorlesung/ParProg-Grundlagen.html

<div id="outline-container-org89236ab" class="outline-4">
<h4 id="org89236ab">The ParallelSort Program in Java</h4>
<div class="outline-text-4" id="text-org89236ab">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #036A07;">/** A Java program to illustrate the potential speedup of parallelism, in this</span>
<span style="color: #036A07;">    case for sorting: the program uses the new (as of Java 8) Arrays.parallelSort</span>
<span style="color: #036A07;">    method, and also the Arrays.parallelSetAll method for parallel initialization</span>
<span style="color: #036A07;">    of the roughly 4M array of integers.</span>

<span style="color: #036A07;">    As noted, Java 8 or greater is requied.</span>
<span style="color: #036A07;">*/</span>
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Random</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Arrays</span>;

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">ParallelSort</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span><span style="color: #7388D6;">[</span> <span style="color: #7388D6;">]</span> <span style="color: #BA36A5;">array2Sort</span>;
    
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span><span style="color: #909183;">[</span> <span style="color: #909183;">]</span> <span style="color: #BA36A5;">args</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ParallelSort</span><span style="color: #909183;">()</span>.doIt<span style="color: #909183;">()</span>;
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">doIt</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">arraySize</span> = 1024 * 1024 * 4;  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">about 4M: 4,194,304     /** line 1 **/</span>

        <span style="color: #8D8D84;">//</span><span style="color: #8D8D84; font-style: italic;">** serial sort</span>
        init<span style="color: #909183;">(</span>arraySize<span style="color: #909183;">)</span>;
        <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">serial</span> = sortArray<span style="color: #909183;">(</span>array2Sort, <span style="color: #D0372D;">false</span><span style="color: #909183;">)</span>;                        <span style="color: #036A07;">/** line 2 **/</span>

        <span style="color: #8D8D84;">//</span><span style="color: #8D8D84; font-style: italic;">** parallel sort</span>
        init<span style="color: #909183;">(</span>arraySize<span style="color: #909183;">)</span>;
        <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">parallel</span> = sortArray<span style="color: #909183;">(</span>array2Sort, <span style="color: #D0372D;">true</span><span style="color: #909183;">)</span>;                       <span style="color: #036A07;">/** line 3 **/</span>

        <span style="color: #8D8D84;">//</span><span style="color: #8D8D84; font-style: italic;">** report</span>
        log<span style="color: #909183;">(</span><span style="color: #008000;">"Serial sort of array of size:   "</span> + arraySize<span style="color: #909183;">)</span>;
        log<span style="color: #909183;">(</span><span style="color: #008000;">"Elapsed time: "</span> + serial<span style="color: #909183;">)</span>;
        log<span style="color: #909183;">(</span><span style="color: #008000;">""</span><span style="color: #909183;">)</span>;

        log<span style="color: #909183;">(</span><span style="color: #008000;">"Parallel sort of array of size: "</span> + arraySize<span style="color: #909183;">)</span>; 
        log<span style="color: #909183;">(</span><span style="color: #008000;">"Elapsed time: "</span> + parallel<span style="color: #909183;">)</span>;

        log<span style="color: #909183;">(</span><span style="color: #008000;">""</span><span style="color: #909183;">)</span>;
        <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">ratio</span> = <span style="color: #909183;">(</span><span style="color: #6434A3;">double</span><span style="color: #909183;">)</span> serial / <span style="color: #909183;">(</span><span style="color: #6434A3;">double</span><span style="color: #909183;">)</span> parallel;
        <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>parallel &lt; <span style="color: #6434A3;">serial</span><span style="color: #909183;">)</span> 
            log<span style="color: #909183;">(</span><span style="color: #008000;">"Speedup:  "</span> + ratio<span style="color: #909183;">)</span>;
        <span style="color: #0000FF;">else</span>
            log<span style="color: #909183;">(</span><span style="color: #008000;">"Slowdown: "</span> + ratio<span style="color: #909183;">)</span>;
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">init</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">size</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        array2Sort = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">int</span><span style="color: #909183;">[</span>size<span style="color: #909183;">]</span>;
        <span style="color: #036A07;">/** parallel initialization of array elements **/</span>
        Arrays.parallelSetAll<span style="color: #909183;">(</span>array2Sort,                                  <span style="color: #036A07;">/** line 4 **/</span> 
                              i-&gt;<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Random</span><span style="color: #709870;">()</span>.nextInt<span style="color: #709870;">()</span><span style="color: #909183;">)</span>;                  <span style="color: #036A07;">/** line 5 **/</span>
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">long</span> <span style="color: #006699;">sortArray</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span><span style="color: #909183;">[</span> <span style="color: #909183;">]</span> <span style="color: #BA36A5;">array</span>, <span style="color: #6434A3;">boolean</span> <span style="color: #BA36A5;">parallel</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">start</span> = System.currentTimeMillis<span style="color: #909183;">()</span>;
        <span style="color: #036A07;">/** parallel version of merge-sort **/</span>
        <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>parallel<span style="color: #909183;">)</span> Arrays.parallelSort<span style="color: #909183;">(</span>array<span style="color: #909183;">)</span>;                          <span style="color: #036A07;">/** line 6 **/</span>
        <span style="color: #036A07;">/** variant of quicksort ('dual pivot') **/</span>
        <span style="color: #0000FF;">else</span> Arrays.sort<span style="color: #909183;">(</span>array<span style="color: #909183;">)</span>;                                           <span style="color: #036A07;">/** line 7 **/</span>
        <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">stop</span> = System.currentTimeMillis<span style="color: #909183;">()</span>;
        <span style="color: #0000FF;">return</span> stop - start;
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">log</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">msg</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        System.out.println<span style="color: #909183;">(</span>msg<span style="color: #909183;">)</span>;
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
<div id="outline-container-org6fc9ae2" class="outline-5">
<h5 id="org6fc9ae2">using the shell</h5>
<div class="outline-text-5" id="text-org6fc9ae2">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ java ParallelSort
Serial sort of array of size:   4194304
Elapsed time: 824

Parallel sort of array of size: 4194304
Elapsed time: 358

Speedup:  2.3016759776536313
bash-3.2$ java ParallelSort
Serial sort of array of size:   4194304
Elapsed time: 710

Parallel sort of array of size: 4194304
Elapsed time: 258

Speedup:  2.751937984496124
bash-3.2$ java ParallelSort
Serial sort of array of size:   4194304
Elapsed time: 807

Parallel sort of array of size: 4194304
Elapsed time: 295

Speedup:  2.7355932203389832</pre>
</pre>
</div>
</div>
</div>
</div>
